export const localData = {
  fareVars: {
    "lastModified": 1708444607,
    "freeDis": 100,
    "staToId": {
      "苹果园": 1,
      "古城": 2,
      "八角游乐园": 3,
      "八宝山": 4,
      "玉泉路": 5,
      "五棵松": 6,
      "万寿路": 7,
      "公主坟": 8,
      "军事博物馆": 9,
      "南礼士路": 11,
      "复兴门": 12,
      "西单": 13,
      "天安门西": 14,
      "天安门东": 15,
      "王府井": 16,
      "东单": 17,
      "建国门": 18,
      "永安里": 19,
      "国贸": 20,
      "大望路": 21,
      "四惠": 22,
      "四惠东": 23,
      "西直门": 24,
      "积水潭": 25,
      "鼓楼大街": 26,
      "安定门": 27,
      "雍和宫": 28,
      "东直门": 29,
      "东四十条": 30,
      "朝阳门": 31,
      "北京站": 32,
      "崇文门": 33,
      "前门": 34,
      "和平门": 35,
      "宣武门": 36,
      "长椿街": 37,
      "阜成门": 38,
      "车公庄": 39,
      "公益西桥": 40,
      "角门西": 41,
      "马家堡": 42,
      "北京南站": 43,
      "陶然亭": 44,
      "菜市口": 45,
      "灵境胡同": 46,
      "西四": 47,
      "平安里": 48,
      "新街口": 49,
      "动物园": 50,
      "国家图书馆": 51,
      "魏公村": 52,
      "人民大学": 53,
      "海淀黄庄": 54,
      "中关村": 55,
      "北京大学东门": 56,
      "圆明园": 57,
      "西苑": 58,
      "北宫门": 59,
      "安河桥北": 60,
      "宋家庄": 61,
      "刘家窑": 62,
      "蒲黄榆": 63,
      "天坛东门": 64,
      "磁器口": 65,
      "灯市口": 66,
      "东四": 67,
      "张自忠路": 68,
      "北新桥": 69,
      "和平里北街": 70,
      "和平西桥": 71,
      "惠新西街南口": 72,
      "惠新西街北口": 73,
      "大屯路东": 74,
      "北苑路北": 75,
      "立水桥南": 76,
      "立水桥": 77,
      "天通苑南": 78,
      "天通苑": 79,
      "天通苑北": 80,
      "海淀五路居": 81,
      "慈寿寺": 82,
      "花园桥": 83,
      "白石桥南": 84,
      "车公庄西": 85,
      "北海北": 86,
      "南锣鼓巷": 87,
      "东大桥": 88,
      "呼家楼": 89,
      "金台路": 90,
      "十里堡": 91,
      "青年路": 92,
      "褡裢坡": 93,
      "黄渠": 94,
      "常营": 95,
      "草房": 96,
      "物资学院路": 97,
      "通州北关": 98,
      "通运门": 99,
      "北运河西": 100,
      "北运河东": 101,
      "郝家府": 102,
      "东夏园": 103,
      "潞城": 104,
      "北京西站": 105,
      "湾子": 106,
      "达官营": 107,
      "广安门内": 108,
      "虎坊桥": 109,
      "珠市口": 110,
      "桥湾": 111,
      "广渠门内": 112,
      "广渠门外": 113,
      "双井": 114,
      "九龙山": 115,
      "大郊亭": 116,
      "百子湾": 117,
      "化工": 118,
      "南楼梓庄": 119,
      "欢乐谷景区": 120,
      "垡头": 121,
      "双合": 122,
      "焦化厂": 123,
      "朱辛庄": 124,
      "育知路": 125,
      "平西府": 126,
      "回龙观东大街": 127,
      "霍营": 128,
      "育新": 129,
      "西小口": 130,
      "永泰庄": 131,
      "林萃桥": 132,
      "森林公园南门": 133,
      "奥林匹克公园": 134,
      "奥体中心": 135,
      "北土城": 136,
      "安华桥": 137,
      "安德里北街": 138,
      "什刹海": 139,
      "郭公庄": 140,
      "丰台科技园": 141,
      "科怡路": 142,
      "丰台南路": 143,
      "丰台东大街": 144,
      "七里庄": 145,
      "六里桥": 146,
      "六里桥东": 147,
      "白堆子": 148,
      "巴沟": 149,
      "苏州街": 150,
      "知春里": 151,
      "知春路": 152,
      "西土城": 153,
      "牡丹园": 154,
      "健德门": 155,
      "安贞门": 156,
      "芍药居": 157,
      "太阳宫": 158,
      "三元桥": 159,
      "亮马桥": 160,
      "农业展览馆": 161,
      "团结湖": 162,
      "金台夕照": 163,
      "劲松": 164,
      "潘家园": 165,
      "十里河": 166,
      "分钟寺": 167,
      "成寿寺": 168,
      "石榴庄": 169,
      "大红门": 170,
      "角门东": 171,
      "草桥": 172,
      "纪家庙": 173,
      "首经贸": 174,
      "丰台站": 175,
      "泥洼": 176,
      "西局": 177,
      "莲花桥": 178,
      "西钓鱼台": 179,
      "车道沟": 180,
      "长春桥": 181,
      "火器营": 182,
      "大钟寺": 183,
      "五道口": 184,
      "上地": 185,
      "西二旗": 186,
      "龙泽": 187,
      "回龙观": 188,
      "北苑": 189,
      "望京西": 190,
      "光熙门": 191,
      "柳芳": 192,
      "张郭庄": 193,
      "园博园": 194,
      "大瓦窑": 195,
      "郭庄子": 196,
      "大井": 197,
      "永定门外": 198,
      "景泰": 199,
      "方庄": 200,
      "北工大西门": 201,
      "平乐园": 202,
      "朝阳公园": 203,
      "枣营": 204,
      "东风北桥": 205,
      "将台": 206,
      "望京南": 207,
      "阜通": 208,
      "望京": 209,
      "东湖渠": 210,
      "来广营": 211,
      "善各庄": 212,
      "俸伯": 213,
      "顺义": 214,
      "石门": 215,
      "南法信": 216,
      "后沙峪": 217,
      "花梨坎": 218,
      "国展": 219,
      "孙河": 220,
      "马泉营": 221,
      "崔各庄": 222,
      "望京东": 223,
      "关庄": 224,
      "安立路": 225,
      "北沙滩": 226,
      "六道口": 227,
      "清华东路西口": 228,
      "农大南路": 229,
      "马连洼": 230,
      "西北旺": 231,
      "永丰南": 232,
      "永丰": 233,
      "屯佃": 234,
      "稻香湖路": 235,
      "温阳路": 236,
      "北安河": 237,
      "高碑店": 238,
      "传媒大学": 239,
      "双桥": 240,
      "管庄": 241,
      "八里桥": 242,
      "通州北苑": 243,
      "果园": 244,
      "九棵树": 245,
      "梨园": 246,
      "临河里": 247,
      "土桥": 248,
      "天宫院": 249,
      "生物医药基地": 250,
      "义和庄": 251,
      "黄村火车站": 252,
      "黄村西大街": 253,
      "清源路": 254,
      "枣园": 255,
      "高米店南": 256,
      "高米店北": 257,
      "西红门": 258,
      "新宫": 259,
      "大葆台": 260,
      "稻田": 261,
      "长阳": 262,
      "篱笆房": 263,
      "广阳城": 264,
      "良乡大学城北": 265,
      "良乡大学城": 266,
      "良乡大学城西": 267,
      "良乡南关": 268,
      "苏庄": 269,
      "阎村东": 270,
      "昌平西山口": 271,
      "十三陵景区": 272,
      "昌平": 273,
      "昌平东关": 274,
      "北邵洼": 275,
      "南邵": 276,
      "沙河高教园": 277,
      "沙河": 278,
      "巩华城": 279,
      "生命科学园": 280,
      "肖村": 281,
      "小红门": 282,
      "旧宫": 283,
      "亦庄桥": 284,
      "亦庄文化园": 285,
      "万源街": 286,
      "荣京东街": 287,
      "荣昌东街": 288,
      "同济南路": 289,
      "经海路": 290,
      "次渠南": 291,
      "次渠": 292,
      "亦庄火车站": 293,
      "紫草坞": 294,
      "阎村": 295,
      "星城": 296,
      "大石河东": 297,
      "马各庄": 298,
      "饶乐府": 299,
      "房山城关": 300,
      "燕山": 301,
      "金安桥": 302,
      "四道桥": 303,
      "桥户营": 304,
      "上岸": 305,
      "栗园庄": 306,
      "小园": 307,
      "石厂": 308,
      "中国美术馆": 316,
      "天桥": 317,
      "海户屯": 318,
      "木樨园": 319,
      "大红门南": 320,
      "和义": 321,
      "东高地": 322,
      "火箭万源": 323,
      "五福堂": 324,
      "德茂": 325,
      "瀛海": 326,
      "田村": 327,
      "廖公庄": 328,
      "西黄村": 329,
      "杨庄": 330,
      "黄厂": 349,
      "郎辛庄": 350,
      "黑庄户": 351,
      "万盛西": 352,
      "万盛东": 353,
      "群芳": 354,
      "高楼金": 355,
      "花庄": 356,
      "环球度假区": 357,
      "清河站": 358,
      "陶然桥": 359,
      "高家园": 360,
      "万泉河桥": 381,
      "苏州桥": 382,
      "万寿寺": 383,
      "甘家口": 384,
      "东管头南": 389,
      "花乡东桥": 390,
      "白盆窑": 391,
      "金鱼胡同": 395,
      "北辛安": 398,
      "新首钢": 399,
      "东管头": 400,
      "丽泽商务区": 401,
      "菜户营": 402,
      "西铁营": 403,
      "玉渊潭东门": 405,
      "周家庄": 406,
      "十八里店": 407,
      "北神树": 408,
      "次渠北": 409,
      "嘉会湖": 410,
      "北太平庄": 411,
      "太平桥": 412,
      "牛街": 413,
      "新发地": 415,
      "景风门": 416,
      "模式口": 417,
      "二里沟": 419,
      "红莲南路": 422,
      "富丰桥": 426,
      "看丹": 427,
      "榆树庄": 428,
      "宛平城": 429,
      "朱房北": 430,
      "清河小营桥": 431,
      "学院桥": 434,
      "学知园": 439,
      "洪泰庄": 441,
      "未来科学城北": 442,
      "未来科学城": 443,
      "天通苑东": 445,
      "清河营": 446,
      "红军营": 447,
      "西坝河": 448,
      "左家庄": 449,
      "工人体育场": 450,
      "红庙": 1002,
      "南八里庄": 1001,
      "木樨地1": 2001,
      "木樨地16": 2002,
      "望京西17": 2003
    },
    "staDict": {
      "1": {
        "name": "苹果园",
        "edges": {
          "2": [{
            "line": 1,
            "sta": [1, 2],
            "dis": 2606,
            "dir": false
          }],
          "330": [{
            "line": 6,
            "sta": [1, 330],
            "dis": 839,
            "dir": false
          }],
          "302": [{
            "line": 6,
            "sta": [1, 302],
            "dis": 1438,
            "dir": true
          }, {
            "line": 91,
            "sta": [1, 302],
            "dis": 1419,
            "dir": true
          }]
        }
      },
      "2": {
        "name": "古城",
        "edges": {
          "3": [{
            "line": 1,
            "sta": [2, 3],
            "dis": 1921,
            "dir": false
          }],
          "1": [{
            "line": 1,
            "sta": [2, 1],
            "dis": 2606,
            "dir": true
          }]
        }
      },
      "3": {
        "name": "八角游乐园",
        "edges": {
          "4": [{
            "line": 1,
            "sta": [3, 4],
            "dis": 1953,
            "dir": false
          }],
          "2": [{
            "line": 1,
            "sta": [3, 2],
            "dis": 1921,
            "dir": true
          }]
        }
      },
      "4": {
        "name": "八宝山",
        "edges": {
          "5": [{
            "line": 1,
            "sta": [4, 5],
            "dis": 1479,
            "dir": false
          }],
          "3": [{
            "line": 1,
            "sta": [4, 3],
            "dis": 1953,
            "dir": true
          }]
        }
      },
      "5": {
        "name": "玉泉路",
        "edges": {
          "6": [{
            "line": 1,
            "sta": [5, 6],
            "dis": 1810,
            "dir": false
          }],
          "4": [{
            "line": 1,
            "sta": [5, 4],
            "dis": 1479,
            "dir": true
          }]
        }
      },
      "6": {
        "name": "五棵松",
        "edges": {
          "7": [{
            "line": 1,
            "sta": [6, 7],
            "dis": 1778,
            "dir": false
          }],
          "5": [{
            "line": 1,
            "sta": [6, 5],
            "dis": 1810,
            "dir": true
          }]
        }
      },
      "7": {
        "name": "万寿路",
        "edges": {
          "8": [{
            "line": 1,
            "sta": [7, 8],
            "dis": 1313,
            "dir": false
          }],
          "6": [{
            "line": 1,
            "sta": [7, 6],
            "dis": 1778,
            "dir": true
          }]
        }
      },
      "8": {
        "name": "公主坟",
        "edges": {
          "9": [{
            "line": 1,
            "sta": [8, 9],
            "dis": 1172,
            "dir": false
          }],
          "7": [{
            "line": 1,
            "sta": [8, 7],
            "dis": 1313,
            "dir": true
          }],
          "178": [{
            "line": 90,
            "sta": [8, 178],
            "dis": 1016,
            "dir": false
          }],
          "179": [{
            "line": 90,
            "sta": [8, 179],
            "dis": 2386,
            "dir": true
          }]
        }
      },
      "9": {
        "name": "军事博物馆",
        "edges": {
          "2001": [{
            "line": 1,
            "sta": [9, 2001],
            "dis": 1166,
            "dir": false
          }],
          "8": [{
            "line": 1,
            "sta": [9, 8],
            "dis": 1172,
            "dir": true
          }],
          "148": [{
            "line": 9,
            "sta": [9, 148],
            "dis": 1912,
            "dir": false
          }],
          "105": [{
            "line": 9,
            "sta": [9, 105],
            "dis": 1398,
            "dir": true
          }]
        }
      },
      "11": {
        "name": "南礼士路",
        "edges": {
          "12": [{
            "line": 1,
            "sta": [11, 12],
            "dis": 424,
            "dir": false
          }],
          "2001": [{
            "line": 1,
            "sta": [11, 2001],
            "dis": 1291,
            "dir": true
          }]
        }
      },
      "12": {
        "name": "复兴门",
        "edges": {
          "13": [{
            "line": 1,
            "sta": [12, 13],
            "dis": 1590,
            "dir": false
          }],
          "11": [{
            "line": 1,
            "sta": [12, 11],
            "dis": 424,
            "dir": true
          }],
          "37": [{
            "line": 2,
            "sta": [12, 37],
            "dis": 1234,
            "dir": false
          }],
          "38": [{
            "line": 2,
            "sta": [12, 38],
            "dis": 1832,
            "dir": true
          }],
          "412": [{
            "line": 1002,
            "sta": [12, 412],
            "dis": 0,
            "dir": false
          }]
        }
      },
      "13": {
        "name": "西单",
        "edges": {
          "14": [{
            "line": 1,
            "sta": [13, 14],
            "dis": 1217,
            "dir": false
          }],
          "12": [{
            "line": 1,
            "sta": [13, 12],
            "dis": 1590,
            "dir": true
          }],
          "46": [{
            "line": 4,
            "sta": [13, 46],
            "dis": 1011,
            "dir": false
          }],
          "36": [{
            "line": 4,
            "sta": [13, 36],
            "dis": 815,
            "dir": true
          }]
        }
      },
      "14": {
        "name": "天安门西",
        "edges": {
          "15": [{
            "line": 1,
            "sta": [14, 15],
            "dis": 925,
            "dir": false
          }],
          "13": [{
            "line": 1,
            "sta": [14, 13],
            "dis": 1217,
            "dir": true
          }]
        }
      },
      "15": {
        "name": "天安门东",
        "edges": {
          "16": [{
            "line": 1,
            "sta": [15, 16],
            "dis": 852,
            "dir": false
          }],
          "14": [{
            "line": 1,
            "sta": [15, 14],
            "dis": 925,
            "dir": true
          }]
        }
      },
      "16": {
        "name": "王府井",
        "edges": {
          "17": [{
            "line": 1,
            "sta": [16, 17],
            "dis": 774,
            "dir": false
          }],
          "15": [{
            "line": 1,
            "sta": [16, 15],
            "dis": 852,
            "dir": true
          }],
          "395": [{
            "line": 8,
            "sta": [16, 395],
            "dis": 762,
            "dir": false
          }],
          "34": [{
            "line": 8,
            "sta": [16, 34],
            "dis": 1857,
            "dir": true
          }]
        }
      },
      "17": {
        "name": "东单",
        "edges": {
          "18": [{
            "line": 1,
            "sta": [17, 18],
            "dis": 1230,
            "dir": false
          }],
          "16": [{
            "line": 1,
            "sta": [17, 16],
            "dis": 774,
            "dir": true
          }],
          "33": [{
            "line": 5,
            "sta": [17, 33],
            "dis": 821,
            "dir": false
          }],
          "66": [{
            "line": 5,
            "sta": [17, 66],
            "dis": 945,
            "dir": true
          }]
        }
      },
      "18": {
        "name": "建国门",
        "edges": {
          "19": [{
            "line": 1,
            "sta": [18, 19],
            "dis": 1377,
            "dir": false
          }],
          "17": [{
            "line": 1,
            "sta": [18, 17],
            "dis": 1230,
            "dir": true
          }],
          "31": [{
            "line": 2,
            "sta": [18, 31],
            "dis": 1763,
            "dir": false
          }],
          "32": [{
            "line": 2,
            "sta": [18, 32],
            "dis": 945,
            "dir": true
          }]
        }
      },
      "19": {
        "name": "永安里",
        "edges": {
          "20": [{
            "line": 1,
            "sta": [19, 20],
            "dis": 790,
            "dir": false
          }],
          "18": [{
            "line": 1,
            "sta": [19, 18],
            "dis": 1377,
            "dir": true
          }]
        }
      },
      "20": {
        "name": "国贸",
        "edges": {
          "21": [{
            "line": 1,
            "sta": [20, 21],
            "dis": 1385,
            "dir": false
          }],
          "19": [{
            "line": 1,
            "sta": [20, 19],
            "dis": 790,
            "dir": true
          }],
          "163": [{
            "line": 10,
            "sta": [20, 163],
            "dis": 835,
            "dir": false
          }],
          "114": [{
            "line": 10,
            "sta": [20, 114],
            "dis": 1759,
            "dir": true
          }]
        }
      },
      "21": {
        "name": "大望路",
        "edges": {
          "22": [{
            "line": 1,
            "sta": [21, 22],
            "dis": 1673,
            "dir": false
          }],
          "20": [{
            "line": 1,
            "sta": [21, 20],
            "dis": 1385,
            "dir": true
          }],
          "1002": [{
            "line": 14,
            "sta": [21, 1002],
            "dis": 708,
            "dir": false
          }],
          "115": [{
            "line": 14,
            "sta": [21, 115],
            "dis": 1780,
            "dir": true
          }]
        }
      },
      "22": {
        "name": "四惠",
        "edges": {
          "23": [{
            "line": 1,
            "sta": [22, 23],
            "dis": 1714,
            "dir": false
          }, {
            "line": 97,
            "sta": [22, 23],
            "dis": 1715,
            "dir": false
          }],
          "21": [{
            "line": 1,
            "sta": [22, 21],
            "dis": 1673,
            "dir": true
          }]
        }
      },
      "23": {
        "name": "四惠东",
        "edges": {
          "22": [{
            "line": 1,
            "sta": [23, 22],
            "dis": 1714,
            "dir": true
          }, {
            "line": 97,
            "sta": [23, 22],
            "dis": 1715,
            "dir": true
          }],
          "238": [{
            "line": 97,
            "sta": [23, 238],
            "dis": 1375,
            "dir": false
          }]
        }
      },
      "24": {
        "name": "西直门",
        "edges": {
          "39": [{
            "line": 2,
            "sta": [24, 39],
            "dis": 909,
            "dir": false
          }],
          "25": [{
            "line": 2,
            "sta": [24, 25],
            "dis": 1899,
            "dir": false
          }],
          "50": [{
            "line": 4,
            "sta": [24, 50],
            "dis": 1441,
            "dir": false
          }],
          "49": [{
            "line": 4,
            "sta": [24, 49],
            "dis": 1025,
            "dir": true
          }],
          "183": [{
            "line": 13,
            "sta": [24, 183],
            "dis": 2839,
            "dir": true
          }]
        }
      },
      "25": {
        "name": "积水潭",
        "edges": {
          "24": [{
            "line": 2,
            "sta": [25, 24],
            "dis": 1899,
            "dir": true
          }],
          "26": [{
            "line": 2,
            "sta": [25, 26],
            "dis": 1766,
            "dir": true
          }],
          "411": [{
            "line": 19,
            "sta": [25, 411],
            "dis": 2450,
            "dir": false
          }],
          "48": [{
            "line": 19,
            "sta": [25, 48],
            "dis": 1590,
            "dir": true
          }]
        }
      },
      "26": {
        "name": "鼓楼大街",
        "edges": {
          "25": [{
            "line": 2,
            "sta": [26, 25],
            "dis": 1766,
            "dir": false
          }],
          "27": [{
            "line": 2,
            "sta": [26, 27],
            "dis": 1237,
            "dir": true
          }],
          "138": [{
            "line": 8,
            "sta": [26, 138],
            "dis": 1083,
            "dir": false
          }],
          "139": [{
            "line": 8,
            "sta": [26, 139],
            "dis": 1188,
            "dir": true
          }]
        }
      },
      "27": {
        "name": "安定门",
        "edges": {
          "26": [{
            "line": 2,
            "sta": [27, 26],
            "dis": 1237,
            "dir": false
          }],
          "28": [{
            "line": 2,
            "sta": [27, 28],
            "dis": 794,
            "dir": true
          }]
        }
      },
      "28": {
        "name": "雍和宫",
        "edges": {
          "27": [{
            "line": 2,
            "sta": [28, 27],
            "dis": 794,
            "dir": false
          }],
          "29": [{
            "line": 2,
            "sta": [28, 29],
            "dis": 2228,
            "dir": true
          }],
          "69": [{
            "line": 5,
            "sta": [28, 69],
            "dis": 866,
            "dir": false
          }],
          "70": [{
            "line": 5,
            "sta": [28, 70],
            "dis": 1151,
            "dir": true
          }]
        }
      },
      "29": {
        "name": "东直门",
        "edges": {
          "28": [{
            "line": 2,
            "sta": [29, 28],
            "dis": 2228,
            "dir": false
          }],
          "30": [{
            "line": 2,
            "sta": [29, 30],
            "dis": 824,
            "dir": true
          }],
          "192": [{
            "line": 13,
            "sta": [29, 192],
            "dis": 1769,
            "dir": false
          }]
        }
      },
      "30": {
        "name": "东四十条",
        "edges": {
          "29": [{
            "line": 2,
            "sta": [30, 29],
            "dis": 824,
            "dir": false
          }],
          "31": [{
            "line": 2,
            "sta": [30, 31],
            "dis": 1027,
            "dir": true
          }]
        }
      },
      "31": {
        "name": "朝阳门",
        "edges": {
          "30": [{
            "line": 2,
            "sta": [31, 30],
            "dis": 1027,
            "dir": false
          }],
          "18": [{
            "line": 2,
            "sta": [31, 18],
            "dis": 1763,
            "dir": true
          }],
          "88": [{
            "line": 6,
            "sta": [31, 88],
            "dis": 1668,
            "dir": false
          }],
          "67": [{
            "line": 6,
            "sta": [31, 67],
            "dis": 1399,
            "dir": true
          }]
        }
      },
      "32": {
        "name": "北京站",
        "edges": {
          "18": [{
            "line": 2,
            "sta": [32, 18],
            "dis": 945,
            "dir": false
          }],
          "33": [{
            "line": 2,
            "sta": [32, 33],
            "dis": 1023,
            "dir": true
          }]
        }
      },
      "33": {
        "name": "崇文门",
        "edges": {
          "32": [{
            "line": 2,
            "sta": [33, 32],
            "dis": 1023,
            "dir": false
          }],
          "34": [{
            "line": 2,
            "sta": [33, 34],
            "dis": 1634,
            "dir": true
          }],
          "65": [{
            "line": 5,
            "sta": [33, 65],
            "dis": 876,
            "dir": false
          }],
          "17": [{
            "line": 5,
            "sta": [33, 17],
            "dis": 821,
            "dir": true
          }]
        }
      },
      "34": {
        "name": "前门",
        "edges": {
          "33": [{
            "line": 2,
            "sta": [34, 33],
            "dis": 1634,
            "dir": false
          }],
          "35": [{
            "line": 2,
            "sta": [34, 35],
            "dis": 1171,
            "dir": true
          }],
          "16": [{
            "line": 8,
            "sta": [34, 16],
            "dis": 1857,
            "dir": false
          }],
          "110": [{
            "line": 8,
            "sta": [34, 110],
            "dis": 1085,
            "dir": true
          }]
        }
      },
      "35": {
        "name": "和平门",
        "edges": {
          "34": [{
            "line": 2,
            "sta": [35, 34],
            "dis": 1171,
            "dir": false
          }],
          "36": [{
            "line": 2,
            "sta": [35, 36],
            "dis": 851,
            "dir": true
          }]
        }
      },
      "36": {
        "name": "宣武门",
        "edges": {
          "35": [{
            "line": 2,
            "sta": [36, 35],
            "dis": 851,
            "dir": false
          }],
          "37": [{
            "line": 2,
            "sta": [36, 37],
            "dis": 929,
            "dir": true
          }],
          "13": [{
            "line": 4,
            "sta": [36, 13],
            "dis": 815,
            "dir": false
          }],
          "45": [{
            "line": 4,
            "sta": [36, 45],
            "dis": 1152,
            "dir": true
          }]
        }
      },
      "37": {
        "name": "长椿街",
        "edges": {
          "36": [{
            "line": 2,
            "sta": [37, 36],
            "dis": 929,
            "dir": false
          }],
          "12": [{
            "line": 2,
            "sta": [37, 12],
            "dis": 1234,
            "dir": true
          }]
        }
      },
      "38": {
        "name": "阜成门",
        "edges": {
          "12": [{
            "line": 2,
            "sta": [38, 12],
            "dis": 1832,
            "dir": false
          }],
          "39": [{
            "line": 2,
            "sta": [38, 39],
            "dis": 960,
            "dir": true
          }]
        }
      },
      "39": {
        "name": "车公庄",
        "edges": {
          "38": [{
            "line": 2,
            "sta": [39, 38],
            "dis": 960,
            "dir": false
          }],
          "24": [{
            "line": 2,
            "sta": [39, 24],
            "dis": 909,
            "dir": true
          }],
          "48": [{
            "line": 6,
            "sta": [39, 48],
            "dis": 1443,
            "dir": false
          }],
          "85": [{
            "line": 6,
            "sta": [39, 85],
            "dis": 887,
            "dir": true
          }]
        }
      },
      "40": {
        "name": "公益西桥",
        "edges": {
          "41": [{
            "line": 4,
            "sta": [40, 41],
            "dis": 989,
            "dir": false
          }],
          "259": [{
            "line": 93,
            "sta": [40, 259],
            "dis": 2798,
            "dir": true
          }]
        }
      },
      "41": {
        "name": "角门西",
        "edges": {
          "42": [{
            "line": 4,
            "sta": [41, 42],
            "dis": 827,
            "dir": false
          }],
          "40": [{
            "line": 4,
            "sta": [41, 40],
            "dis": 989,
            "dir": true
          }],
          "171": [{
            "line": 90,
            "sta": [41, 171],
            "dis": 1254,
            "dir": false
          }],
          "172": [{
            "line": 90,
            "sta": [41, 172],
            "dis": 1688,
            "dir": true
          }]
        }
      },
      "42": {
        "name": "马家堡",
        "edges": {
          "43": [{
            "line": 4,
            "sta": [42, 43],
            "dis": 1480,
            "dir": false
          }],
          "41": [{
            "line": 4,
            "sta": [42, 41],
            "dis": 827,
            "dir": true
          }]
        }
      },
      "43": {
        "name": "北京南站",
        "edges": {
          "44": [{
            "line": 4,
            "sta": [43, 44],
            "dis": 1643,
            "dir": false
          }],
          "42": [{
            "line": 4,
            "sta": [43, 42],
            "dis": 1480,
            "dir": true
          }],
          "359": [{
            "line": 14,
            "sta": [43, 359],
            "dis": 887,
            "dir": false
          }],
          "416": [{
            "line": 14,
            "sta": [43, 416],
            "dis": 1164,
            "dir": true
          }]
        }
      },
      "44": {
        "name": "陶然亭",
        "edges": {
          "45": [{
            "line": 4,
            "sta": [44, 45],
            "dis": 1200,
            "dir": false
          }],
          "43": [{
            "line": 4,
            "sta": [44, 43],
            "dis": 1643,
            "dir": true
          }]
        }
      },
      "45": {
        "name": "菜市口",
        "edges": {
          "36": [{
            "line": 4,
            "sta": [45, 36],
            "dis": 1152,
            "dir": false
          }],
          "44": [{
            "line": 4,
            "sta": [45, 44],
            "dis": 1200,
            "dir": true
          }],
          "109": [{
            "line": 7,
            "sta": [45, 109],
            "dis": 885,
            "dir": false
          }],
          "108": [{
            "line": 7,
            "sta": [45, 108],
            "dis": 1374,
            "dir": true
          }]
        }
      },
      "46": {
        "name": "灵境胡同",
        "edges": {
          "47": [{
            "line": 4,
            "sta": [46, 47],
            "dis": 869,
            "dir": false
          }],
          "13": [{
            "line": 4,
            "sta": [46, 13],
            "dis": 1011,
            "dir": true
          }]
        }
      },
      "47": {
        "name": "西四",
        "edges": {
          "48": [{
            "line": 4,
            "sta": [47, 48],
            "dis": 1100,
            "dir": false
          }],
          "46": [{
            "line": 4,
            "sta": [47, 46],
            "dis": 869,
            "dir": true
          }]
        }
      },
      "48": {
        "name": "平安里",
        "edges": {
          "49": [{
            "line": 4,
            "sta": [48, 49],
            "dis": 1100,
            "dir": false
          }],
          "47": [{
            "line": 4,
            "sta": [48, 47],
            "dis": 1100,
            "dir": true
          }],
          "86": [{
            "line": 6,
            "sta": [48, 86],
            "dis": 1321,
            "dir": false
          }],
          "39": [{
            "line": 6,
            "sta": [48, 39],
            "dis": 1443,
            "dir": true
          }],
          "25": [{
            "line": 19,
            "sta": [48, 25],
            "dis": 1590,
            "dir": false
          }],
          "412": [{
            "line": 19,
            "sta": [48, 412],
            "dis": 2710,
            "dir": true
          }]
        }
      },
      "49": {
        "name": "新街口",
        "edges": {
          "24": [{
            "line": 4,
            "sta": [49, 24],
            "dis": 1025,
            "dir": false
          }],
          "48": [{
            "line": 4,
            "sta": [49, 48],
            "dis": 1100,
            "dir": true
          }]
        }
      },
      "50": {
        "name": "动物园",
        "edges": {
          "51": [{
            "line": 4,
            "sta": [50, 51],
            "dis": 1517,
            "dir": false
          }],
          "24": [{
            "line": 4,
            "sta": [50, 24],
            "dis": 1441,
            "dir": true
          }]
        }
      },
      "51": {
        "name": "国家图书馆",
        "edges": {
          "52": [{
            "line": 4,
            "sta": [51, 52],
            "dis": 1658,
            "dir": false
          }],
          "50": [{
            "line": 4,
            "sta": [51, 50],
            "dis": 1517,
            "dir": true
          }],
          "84": [{
            "line": 9,
            "sta": [51, 84],
            "dis": 1096,
            "dir": true
          }],
          "383": [{
            "line": 16,
            "sta": [51, 383],
            "dis": 1721,
            "dir": false
          }],
          "419": [{
            "line": 16,
            "sta": [51, 419],
            "dis": 1589,
            "dir": true
          }]
        }
      },
      "52": {
        "name": "魏公村",
        "edges": {
          "53": [{
            "line": 4,
            "sta": [52, 53],
            "dis": 1051,
            "dir": false
          }],
          "51": [{
            "line": 4,
            "sta": [52, 51],
            "dis": 1658,
            "dir": true
          }]
        }
      },
      "53": {
        "name": "人民大学",
        "edges": {
          "54": [{
            "line": 4,
            "sta": [53, 54],
            "dis": 1063,
            "dir": false
          }],
          "52": [{
            "line": 4,
            "sta": [53, 52],
            "dis": 1051,
            "dir": true
          }]
        }
      },
      "54": {
        "name": "海淀黄庄",
        "edges": {
          "55": [{
            "line": 4,
            "sta": [54, 55],
            "dis": 900,
            "dir": false
          }],
          "53": [{
            "line": 4,
            "sta": [54, 53],
            "dis": 1063,
            "dir": true
          }],
          "150": [{
            "line": 10,
            "sta": [54, 150],
            "dis": 950,
            "dir": false
          }],
          "151": [{
            "line": 10,
            "sta": [54, 151],
            "dis": 975,
            "dir": true
          }]
        }
      },
      "55": {
        "name": "中关村",
        "edges": {
          "56": [{
            "line": 4,
            "sta": [55, 56],
            "dis": 887,
            "dir": false
          }],
          "54": [{
            "line": 4,
            "sta": [55, 54],
            "dis": 900,
            "dir": true
          }]
        }
      },
      "56": {
        "name": "北京大学东门",
        "edges": {
          "57": [{
            "line": 4,
            "sta": [56, 57],
            "dis": 1295,
            "dir": false
          }],
          "55": [{
            "line": 4,
            "sta": [56, 55],
            "dis": 887,
            "dir": true
          }]
        }
      },
      "57": {
        "name": "圆明园",
        "edges": {
          "58": [{
            "line": 4,
            "sta": [57, 58],
            "dis": 1672,
            "dir": false
          }],
          "56": [{
            "line": 4,
            "sta": [57, 56],
            "dis": 1295,
            "dir": true
          }]
        }
      },
      "58": {
        "name": "西苑",
        "edges": {
          "59": [{
            "line": 4,
            "sta": [58, 59],
            "dis": 1251,
            "dir": false
          }],
          "57": [{
            "line": 4,
            "sta": [58, 57],
            "dis": 1672,
            "dir": true
          }],
          "229": [{
            "line": 16,
            "sta": [58, 229],
            "dis": 2690,
            "dir": false
          }],
          "381": [{
            "line": 16,
            "sta": [58, 381],
            "dis": 1980,
            "dir": true
          }]
        }
      },
      "59": {
        "name": "北宫门",
        "edges": {
          "60": [{
            "line": 4,
            "sta": [59, 60],
            "dis": 1363,
            "dir": false
          }],
          "58": [{
            "line": 4,
            "sta": [59, 58],
            "dis": 1251,
            "dir": true
          }]
        }
      },
      "60": {
        "name": "安河桥北",
        "edges": {
          "59": [{
            "line": 4,
            "sta": [60, 59],
            "dis": 1363,
            "dir": true
          }]
        }
      },
      "61": {
        "name": "宋家庄",
        "edges": {
          "62": [{
            "line": 5,
            "sta": [61, 62],
            "dis": 1670,
            "dir": true
          }],
          "168": [{
            "line": 90,
            "sta": [61, 168],
            "dis": 1677,
            "dir": false
          }],
          "169": [{
            "line": 90,
            "sta": [61, 169],
            "dis": 1269,
            "dir": true
          }],
          "281": [{
            "line": 96,
            "sta": [61, 281],
            "dis": 2631,
            "dir": true
          }]
        }
      },
      "62": {
        "name": "刘家窑",
        "edges": {
          "61": [{
            "line": 5,
            "sta": [62, 61],
            "dis": 1670,
            "dir": false
          }],
          "63": [{
            "line": 5,
            "sta": [62, 63],
            "dis": 905,
            "dir": true
          }]
        }
      },
      "63": {
        "name": "蒲黄榆",
        "edges": {
          "62": [{
            "line": 5,
            "sta": [63, 62],
            "dis": 905,
            "dir": false
          }],
          "64": [{
            "line": 5,
            "sta": [63, 64],
            "dis": 1900,
            "dir": true
          }],
          "200": [{
            "line": 14,
            "sta": [63, 200],
            "dis": 1486,
            "dir": false
          }],
          "199": [{
            "line": 14,
            "sta": [63, 199],
            "dis": 1025,
            "dir": true
          }]
        }
      },
      "64": {
        "name": "天坛东门",
        "edges": {
          "63": [{
            "line": 5,
            "sta": [64, 63],
            "dis": 1900,
            "dir": false
          }],
          "65": [{
            "line": 5,
            "sta": [64, 65],
            "dis": 1183,
            "dir": true
          }]
        }
      },
      "65": {
        "name": "磁器口",
        "edges": {
          "64": [{
            "line": 5,
            "sta": [65, 64],
            "dis": 1183,
            "dir": false
          }],
          "33": [{
            "line": 5,
            "sta": [65, 33],
            "dis": 876,
            "dir": true
          }],
          "112": [{
            "line": 7,
            "sta": [65, 112],
            "dis": 1138,
            "dir": false
          }],
          "111": [{
            "line": 7,
            "sta": [65, 111],
            "dis": 1016,
            "dir": true
          }]
        }
      },
      "66": {
        "name": "灯市口",
        "edges": {
          "17": [{
            "line": 5,
            "sta": [66, 17],
            "dis": 945,
            "dir": false
          }],
          "67": [{
            "line": 5,
            "sta": [66, 67],
            "dis": 848,
            "dir": true
          }]
        }
      },
      "67": {
        "name": "东四",
        "edges": {
          "66": [{
            "line": 5,
            "sta": [67, 66],
            "dis": 848,
            "dir": false
          }],
          "68": [{
            "line": 5,
            "sta": [67, 68],
            "dis": 1016,
            "dir": true
          }],
          "31": [{
            "line": 6,
            "sta": [67, 31],
            "dis": 1399,
            "dir": false
          }],
          "87": [{
            "line": 6,
            "sta": [67, 87],
            "dis": 1937,
            "dir": true
          }]
        }
      },
      "68": {
        "name": "张自忠路",
        "edges": {
          "67": [{
            "line": 5,
            "sta": [68, 67],
            "dis": 1016,
            "dir": false
          }],
          "69": [{
            "line": 5,
            "sta": [68, 69],
            "dis": 791,
            "dir": true
          }]
        }
      },
      "69": {
        "name": "北新桥",
        "edges": {
          "68": [{
            "line": 5,
            "sta": [69, 68],
            "dis": 791,
            "dir": false
          }],
          "28": [{
            "line": 5,
            "sta": [69, 28],
            "dis": 866,
            "dir": true
          }]
        }
      },
      "70": {
        "name": "和平里北街",
        "edges": {
          "28": [{
            "line": 5,
            "sta": [70, 28],
            "dis": 1151,
            "dir": false
          }],
          "71": [{
            "line": 5,
            "sta": [70, 71],
            "dis": 1059,
            "dir": true
          }]
        }
      },
      "71": {
        "name": "和平西桥",
        "edges": {
          "70": [{
            "line": 5,
            "sta": [71, 70],
            "dis": 1059,
            "dir": false
          }],
          "72": [{
            "line": 5,
            "sta": [71, 72],
            "dis": 1025,
            "dir": true
          }]
        }
      },
      "72": {
        "name": "惠新西街南口",
        "edges": {
          "71": [{
            "line": 5,
            "sta": [72, 71],
            "dis": 1025,
            "dir": false
          }],
          "73": [{
            "line": 5,
            "sta": [72, 73],
            "dis": 1122,
            "dir": true
          }],
          "156": [{
            "line": 10,
            "sta": [72, 156],
            "dis": 982,
            "dir": false
          }],
          "157": [{
            "line": 10,
            "sta": [72, 157],
            "dis": 1712,
            "dir": true
          }]
        }
      },
      "73": {
        "name": "惠新西街北口",
        "edges": {
          "72": [{
            "line": 5,
            "sta": [73, 72],
            "dis": 1122,
            "dir": false
          }],
          "74": [{
            "line": 5,
            "sta": [73, 74],
            "dis": 1838,
            "dir": true
          }]
        }
      },
      "74": {
        "name": "大屯路东",
        "edges": {
          "73": [{
            "line": 5,
            "sta": [74, 73],
            "dis": 1838,
            "dir": false
          }],
          "75": [{
            "line": 5,
            "sta": [74, 75],
            "dis": 3000,
            "dir": true
          }],
          "224": [{
            "line": 15,
            "sta": [74, 224],
            "dis": 1087,
            "dir": false
          }],
          "225": [{
            "line": 15,
            "sta": [74, 225],
            "dis": 938,
            "dir": true
          }]
        }
      },
      "75": {
        "name": "北苑路北",
        "edges": {
          "74": [{
            "line": 5,
            "sta": [75, 74],
            "dis": 3000,
            "dir": false
          }],
          "76": [{
            "line": 5,
            "sta": [75, 76],
            "dis": 1286,
            "dir": true
          }]
        }
      },
      "76": {
        "name": "立水桥南",
        "edges": {
          "75": [{
            "line": 5,
            "sta": [76, 75],
            "dis": 1286,
            "dir": false
          }],
          "77": [{
            "line": 5,
            "sta": [76, 77],
            "dis": 1305,
            "dir": true
          }]
        }
      },
      "77": {
        "name": "立水桥",
        "edges": {
          "76": [{
            "line": 5,
            "sta": [77, 76],
            "dis": 1305,
            "dir": false
          }],
          "78": [{
            "line": 5,
            "sta": [77, 78],
            "dis": 1544,
            "dir": true
          }],
          "128": [{
            "line": 13,
            "sta": [77, 128],
            "dis": 4785,
            "dir": false
          }],
          "189": [{
            "line": 13,
            "sta": [77, 189],
            "dis": 2272,
            "dir": true
          }]
        }
      },
      "78": {
        "name": "天通苑南",
        "edges": {
          "77": [{
            "line": 5,
            "sta": [78, 77],
            "dis": 1544,
            "dir": false
          }],
          "79": [{
            "line": 5,
            "sta": [78, 79],
            "dis": 965,
            "dir": true
          }]
        }
      },
      "79": {
        "name": "天通苑",
        "edges": {
          "78": [{
            "line": 5,
            "sta": [79, 78],
            "dis": 965,
            "dir": false
          }],
          "80": [{
            "line": 5,
            "sta": [79, 80],
            "dis": 939,
            "dir": true
          }]
        }
      },
      "80": {
        "name": "天通苑北",
        "edges": {
          "79": [{
            "line": 5,
            "sta": [80, 79],
            "dis": 939,
            "dir": false
          }]
        }
      },
      "81": {
        "name": "海淀五路居",
        "edges": {
          "82": [{
            "line": 6,
            "sta": [81, 82],
            "dis": 1508,
            "dir": false
          }],
          "327": [{
            "line": 6,
            "sta": [81, 327],
            "dis": 2140,
            "dir": true
          }]
        }
      },
      "82": {
        "name": "慈寿寺",
        "edges": {
          "83": [{
            "line": 6,
            "sta": [82, 83],
            "dis": 1431,
            "dir": false
          }],
          "81": [{
            "line": 6,
            "sta": [82, 81],
            "dis": 1508,
            "dir": true
          }],
          "179": [{
            "line": 90,
            "sta": [82, 179],
            "dis": 1214,
            "dir": false
          }],
          "180": [{
            "line": 90,
            "sta": [82, 180],
            "dis": 1590,
            "dir": true
          }]
        }
      },
      "83": {
        "name": "花园桥",
        "edges": {
          "84": [{
            "line": 6,
            "sta": [83, 84],
            "dis": 1166,
            "dir": false
          }],
          "82": [{
            "line": 6,
            "sta": [83, 82],
            "dis": 1431,
            "dir": true
          }]
        }
      },
      "84": {
        "name": "白石桥南",
        "edges": {
          "419": [{
            "line": 6,
            "sta": [84, 419],
            "dis": 777,
            "dir": false
          }],
          "83": [{
            "line": 6,
            "sta": [84, 83],
            "dis": 1166,
            "dir": true
          }],
          "51": [{
            "line": 9,
            "sta": [84, 51],
            "dis": 1096,
            "dir": false
          }],
          "148": [{
            "line": 9,
            "sta": [84, 148],
            "dis": 943,
            "dir": true
          }]
        }
      },
      "85": {
        "name": "车公庄西",
        "edges": {
          "39": [{
            "line": 6,
            "sta": [85, 39],
            "dis": 887,
            "dir": false
          }],
          "419": [{
            "line": 6,
            "sta": [85, 419],
            "dis": 887,
            "dir": true
          }]
        }
      },
      "86": {
        "name": "北海北",
        "edges": {
          "87": [{
            "line": 6,
            "sta": [86, 87],
            "dis": 1349,
            "dir": false
          }],
          "48": [{
            "line": 6,
            "sta": [86, 48],
            "dis": 1321,
            "dir": true
          }]
        }
      },
      "87": {
        "name": "南锣鼓巷",
        "edges": {
          "67": [{
            "line": 6,
            "sta": [87, 67],
            "dis": 1937,
            "dir": false
          }],
          "86": [{
            "line": 6,
            "sta": [87, 86],
            "dis": 1349,
            "dir": true
          }],
          "139": [{
            "line": 8,
            "sta": [87, 139],
            "dis": 902,
            "dir": false
          }],
          "316": [{
            "line": 8,
            "sta": [87, 316],
            "dis": 1437,
            "dir": true
          }]
        }
      },
      "88": {
        "name": "东大桥",
        "edges": {
          "89": [{
            "line": 6,
            "sta": [88, 89],
            "dis": 845,
            "dir": false
          }],
          "31": [{
            "line": 6,
            "sta": [88, 31],
            "dis": 1668,
            "dir": true
          }]
        }
      },
      "89": {
        "name": "呼家楼",
        "edges": {
          "90": [{
            "line": 6,
            "sta": [89, 90],
            "dis": 1450,
            "dir": false
          }],
          "88": [{
            "line": 6,
            "sta": [89, 88],
            "dis": 845,
            "dir": true
          }],
          "162": [{
            "line": 10,
            "sta": [89, 162],
            "dis": 1149,
            "dir": false
          }],
          "163": [{
            "line": 10,
            "sta": [89, 163],
            "dis": 734,
            "dir": true
          }]
        }
      },
      "90": {
        "name": "金台路",
        "edges": {
          "91": [{
            "line": 6,
            "sta": [90, 91],
            "dis": 2036,
            "dir": false
          }],
          "89": [{
            "line": 6,
            "sta": [90, 89],
            "dis": 1450,
            "dir": true
          }],
          "203": [{
            "line": 14,
            "sta": [90, 203],
            "dis": 1085,
            "dir": false
          }],
          "1002": [{
            "line": 14,
            "sta": [90, 1002],
            "dis": 894,
            "dir": true
          }]
        }
      },
      "91": {
        "name": "十里堡",
        "edges": {
          "92": [{
            "line": 6,
            "sta": [91, 92],
            "dis": 1282,
            "dir": false
          }],
          "90": [{
            "line": 6,
            "sta": [91, 90],
            "dis": 2036,
            "dir": true
          }]
        }
      },
      "92": {
        "name": "青年路",
        "edges": {
          "93": [{
            "line": 6,
            "sta": [92, 93],
            "dis": 3999,
            "dir": false
          }],
          "91": [{
            "line": 6,
            "sta": [92, 91],
            "dis": 1282,
            "dir": true
          }]
        }
      },
      "93": {
        "name": "褡裢坡",
        "edges": {
          "94": [{
            "line": 6,
            "sta": [93, 94],
            "dis": 1238,
            "dir": false
          }],
          "92": [{
            "line": 6,
            "sta": [93, 92],
            "dis": 3999,
            "dir": true
          }]
        }
      },
      "94": {
        "name": "黄渠",
        "edges": {
          "95": [{
            "line": 6,
            "sta": [94, 95],
            "dis": 1854,
            "dir": false
          }],
          "93": [{
            "line": 6,
            "sta": [94, 93],
            "dis": 1238,
            "dir": true
          }]
        }
      },
      "95": {
        "name": "常营",
        "edges": {
          "96": [{
            "line": 6,
            "sta": [95, 96],
            "dis": 1405,
            "dir": false
          }],
          "94": [{
            "line": 6,
            "sta": [95, 94],
            "dis": 1854,
            "dir": true
          }]
        }
      },
      "96": {
        "name": "草房",
        "edges": {
          "97": [{
            "line": 6,
            "sta": [96, 97],
            "dis": 2115,
            "dir": false
          }],
          "95": [{
            "line": 6,
            "sta": [96, 95],
            "dis": 1405,
            "dir": true
          }]
        }
      },
      "97": {
        "name": "物资学院路",
        "edges": {
          "98": [{
            "line": 6,
            "sta": [97, 98],
            "dis": 2557,
            "dir": false
          }],
          "96": [{
            "line": 6,
            "sta": [97, 96],
            "dis": 2115,
            "dir": true
          }]
        }
      },
      "98": {
        "name": "通州北关",
        "edges": {
          "99": [{
            "line": 6,
            "sta": [98, 99],
            "dis": 1468,
            "dir": false
          }],
          "97": [{
            "line": 6,
            "sta": [98, 97],
            "dis": 2557,
            "dir": true
          }]
        }
      },
      "99": {
        "name": "通运门",
        "edges": {
          "100": [{
            "line": 6,
            "sta": [99, 100],
            "dis": 1543,
            "dir": false
          }],
          "98": [{
            "line": 6,
            "sta": [99, 98],
            "dis": 1468,
            "dir": true
          }]
        }
      },
      "100": {
        "name": "北运河西",
        "edges": {
          "101": [{
            "line": 6,
            "sta": [100, 101],
            "dis": 1599,
            "dir": false
          }],
          "99": [{
            "line": 6,
            "sta": [100, 99],
            "dis": 1543,
            "dir": true
          }]
        }
      },
      "101": {
        "name": "北运河东",
        "edges": {
          "102": [{
            "line": 6,
            "sta": [101, 102],
            "dis": 929,
            "dir": false
          }],
          "100": [{
            "line": 6,
            "sta": [101, 100],
            "dis": 1599,
            "dir": true
          }]
        }
      },
      "102": {
        "name": "郝家府",
        "edges": {
          "103": [{
            "line": 6,
            "sta": [102, 103],
            "dis": 1346,
            "dir": false
          }],
          "101": [{
            "line": 6,
            "sta": [102, 101],
            "dis": 929,
            "dir": true
          }]
        }
      },
      "103": {
        "name": "东夏园",
        "edges": {
          "104": [{
            "line": 6,
            "sta": [103, 104],
            "dis": 1194,
            "dir": false
          }],
          "102": [{
            "line": 6,
            "sta": [103, 102],
            "dis": 1346,
            "dir": true
          }]
        }
      },
      "104": {
        "name": "潞城",
        "edges": {
          "103": [{
            "line": 6,
            "sta": [104, 103],
            "dis": 1194,
            "dir": true
          }]
        }
      },
      "105": {
        "name": "北京西站",
        "edges": {
          "106": [{
            "line": 7,
            "sta": [105, 106],
            "dis": 935,
            "dir": false
          }],
          "9": [{
            "line": 9,
            "sta": [105, 9],
            "dis": 1398,
            "dir": false
          }],
          "147": [{
            "line": 9,
            "sta": [105, 147],
            "dis": 1170,
            "dir": true
          }]
        }
      },
      "106": {
        "name": "湾子",
        "edges": {
          "107": [{
            "line": 7,
            "sta": [106, 107],
            "dis": 734,
            "dir": false
          }],
          "105": [{
            "line": 7,
            "sta": [106, 105],
            "dis": 935,
            "dir": true
          }]
        }
      },
      "107": {
        "name": "达官营",
        "edges": {
          "108": [{
            "line": 7,
            "sta": [107, 108],
            "dis": 1874,
            "dir": false
          }],
          "106": [{
            "line": 7,
            "sta": [107, 106],
            "dis": 734,
            "dir": true
          }],
          "2002": [{
            "line": 16,
            "sta": [107, 2002],
            "dis": 2004,
            "dir": false
          }],
          "422": [{
            "line": 16,
            "sta": [107, 422],
            "dis": 1552,
            "dir": true
          }]
        }
      },
      "108": {
        "name": "广安门内",
        "edges": {
          "45": [{
            "line": 7,
            "sta": [108, 45],
            "dis": 1374,
            "dir": false
          }],
          "107": [{
            "line": 7,
            "sta": [108, 107],
            "dis": 1874,
            "dir": true
          }],
          "413": [{
            "line": 1001,
            "sta": [108, 413],
            "dis": 0,
            "dir": false
          }]
        }
      },
      "109": {
        "name": "虎坊桥",
        "edges": {
          "110": [{
            "line": 7,
            "sta": [109, 110],
            "dis": 1205,
            "dir": false
          }],
          "45": [{
            "line": 7,
            "sta": [109, 45],
            "dis": 885,
            "dir": true
          }]
        }
      },
      "110": {
        "name": "珠市口",
        "edges": {
          "111": [{
            "line": 7,
            "sta": [110, 111],
            "dis": 869,
            "dir": false
          }],
          "109": [{
            "line": 7,
            "sta": [110, 109],
            "dis": 1205,
            "dir": true
          }],
          "34": [{
            "line": 8,
            "sta": [110, 34],
            "dis": 1085,
            "dir": false
          }],
          "317": [{
            "line": 8,
            "sta": [110, 317],
            "dis": 881,
            "dir": true
          }]
        }
      },
      "111": {
        "name": "桥湾",
        "edges": {
          "65": [{
            "line": 7,
            "sta": [111, 65],
            "dis": 1016,
            "dir": false
          }],
          "110": [{
            "line": 7,
            "sta": [111, 110],
            "dis": 869,
            "dir": true
          }]
        }
      },
      "112": {
        "name": "广渠门内",
        "edges": {
          "113": [{
            "line": 7,
            "sta": [112, 113],
            "dis": 1332,
            "dir": false
          }],
          "65": [{
            "line": 7,
            "sta": [112, 65],
            "dis": 1138,
            "dir": true
          }]
        }
      },
      "113": {
        "name": "广渠门外",
        "edges": {
          "114": [{
            "line": 7,
            "sta": [113, 114],
            "dis": 1241,
            "dir": false
          }],
          "112": [{
            "line": 7,
            "sta": [113, 112],
            "dis": 1332,
            "dir": true
          }]
        }
      },
      "114": {
        "name": "双井",
        "edges": {
          "115": [{
            "line": 7,
            "sta": [114, 115],
            "dis": 1311,
            "dir": false
          }],
          "113": [{
            "line": 7,
            "sta": [114, 113],
            "dis": 1241,
            "dir": true
          }],
          "20": [{
            "line": 10,
            "sta": [114, 20],
            "dis": 1759,
            "dir": false
          }],
          "164": [{
            "line": 10,
            "sta": [114, 164],
            "dis": 1006,
            "dir": true
          }]
        }
      },
      "115": {
        "name": "九龙山",
        "edges": {
          "116": [{
            "line": 7,
            "sta": [115, 116],
            "dis": 781,
            "dir": false
          }],
          "114": [{
            "line": 7,
            "sta": [115, 114],
            "dis": 1311,
            "dir": true
          }],
          "21": [{
            "line": 14,
            "sta": [115, 21],
            "dis": 1780,
            "dir": false
          }],
          "202": [{
            "line": 14,
            "sta": [115, 202],
            "dis": 897,
            "dir": true
          }]
        }
      },
      "116": {
        "name": "大郊亭",
        "edges": {
          "117": [{
            "line": 7,
            "sta": [116, 117],
            "dis": 865,
            "dir": false
          }],
          "115": [{
            "line": 7,
            "sta": [116, 115],
            "dis": 781,
            "dir": true
          }]
        }
      },
      "117": {
        "name": "百子湾",
        "edges": {
          "118": [{
            "line": 7,
            "sta": [117, 118],
            "dis": 903,
            "dir": false
          }],
          "116": [{
            "line": 7,
            "sta": [117, 116],
            "dis": 865,
            "dir": true
          }]
        }
      },
      "118": {
        "name": "化工",
        "edges": {
          "119": [{
            "line": 7,
            "sta": [118, 119],
            "dis": 1464,
            "dir": false
          }],
          "117": [{
            "line": 7,
            "sta": [118, 117],
            "dis": 903,
            "dir": true
          }]
        }
      },
      "119": {
        "name": "南楼梓庄",
        "edges": {
          "120": [{
            "line": 7,
            "sta": [119, 120],
            "dis": 906,
            "dir": false
          }],
          "118": [{
            "line": 7,
            "sta": [119, 118],
            "dis": 1464,
            "dir": true
          }]
        }
      },
      "120": {
        "name": "欢乐谷景区",
        "edges": {
          "121": [{
            "line": 7,
            "sta": [120, 121],
            "dis": 1679,
            "dir": false
          }],
          "119": [{
            "line": 7,
            "sta": [120, 119],
            "dis": 906,
            "dir": true
          }]
        }
      },
      "121": {
        "name": "垡头",
        "edges": {
          "122": [{
            "line": 7,
            "sta": [121, 122],
            "dis": 1304,
            "dir": false
          }],
          "120": [{
            "line": 7,
            "sta": [121, 120],
            "dis": 1679,
            "dir": true
          }]
        }
      },
      "122": {
        "name": "双合",
        "edges": {
          "123": [{
            "line": 7,
            "sta": [122, 123],
            "dis": 1021,
            "dir": false
          }],
          "121": [{
            "line": 7,
            "sta": [122, 121],
            "dis": 1304,
            "dir": true
          }]
        }
      },
      "123": {
        "name": "焦化厂",
        "edges": {
          "349": [{
            "line": 7,
            "sta": [123, 349],
            "dis": 1678,
            "dir": false
          }],
          "122": [{
            "line": 7,
            "sta": [123, 122],
            "dis": 1021,
            "dir": true
          }]
        }
      },
      "124": {
        "name": "朱辛庄",
        "edges": {
          "125": [{
            "line": 8,
            "sta": [124, 125],
            "dis": 2318,
            "dir": true
          }],
          "279": [{
            "line": 94,
            "sta": [124, 279],
            "dis": 3799,
            "dir": false
          }],
          "280": [{
            "line": 94,
            "sta": [124, 280],
            "dis": 2367,
            "dir": true
          }]
        }
      },
      "125": {
        "name": "育知路",
        "edges": {
          "124": [{
            "line": 8,
            "sta": [125, 124],
            "dis": 2318,
            "dir": false
          }],
          "126": [{
            "line": 8,
            "sta": [125, 126],
            "dis": 1985,
            "dir": true
          }]
        }
      },
      "126": {
        "name": "平西府",
        "edges": {
          "125": [{
            "line": 8,
            "sta": [126, 125],
            "dis": 1985,
            "dir": false
          }],
          "127": [{
            "line": 8,
            "sta": [126, 127],
            "dis": 2056,
            "dir": true
          }]
        }
      },
      "127": {
        "name": "回龙观东大街",
        "edges": {
          "126": [{
            "line": 8,
            "sta": [127, 126],
            "dis": 2056,
            "dir": false
          }],
          "128": [{
            "line": 8,
            "sta": [127, 128],
            "dis": 1114,
            "dir": true
          }]
        }
      },
      "128": {
        "name": "霍营",
        "edges": {
          "127": [{
            "line": 8,
            "sta": [128, 127],
            "dis": 1114,
            "dir": false
          }],
          "129": [{
            "line": 8,
            "sta": [128, 129],
            "dis": 1894,
            "dir": true
          }],
          "188": [{
            "line": 13,
            "sta": [128, 188],
            "dis": 2110,
            "dir": false
          }],
          "77": [{
            "line": 13,
            "sta": [128, 77],
            "dis": 4785,
            "dir": true
          }]
        }
      },
      "129": {
        "name": "育新",
        "edges": {
          "128": [{
            "line": 8,
            "sta": [129, 128],
            "dis": 1894,
            "dir": false
          }],
          "130": [{
            "line": 8,
            "sta": [129, 130],
            "dis": 1543,
            "dir": true
          }]
        }
      },
      "130": {
        "name": "西小口",
        "edges": {
          "129": [{
            "line": 8,
            "sta": [130, 129],
            "dis": 1543,
            "dir": false
          }],
          "131": [{
            "line": 8,
            "sta": [130, 131],
            "dis": 1041,
            "dir": true
          }]
        }
      },
      "131": {
        "name": "永泰庄",
        "edges": {
          "130": [{
            "line": 8,
            "sta": [131, 130],
            "dis": 1041,
            "dir": false
          }],
          "132": [{
            "line": 8,
            "sta": [131, 132],
            "dis": 2553,
            "dir": true
          }]
        }
      },
      "132": {
        "name": "林萃桥",
        "edges": {
          "131": [{
            "line": 8,
            "sta": [132, 131],
            "dis": 2553,
            "dir": false
          }],
          "133": [{
            "line": 8,
            "sta": [132, 133],
            "dis": 2555,
            "dir": true
          }]
        }
      },
      "133": {
        "name": "森林公园南门",
        "edges": {
          "132": [{
            "line": 8,
            "sta": [133, 132],
            "dis": 2555,
            "dir": false
          }],
          "134": [{
            "line": 8,
            "sta": [133, 134],
            "dis": 1016,
            "dir": true
          }]
        }
      },
      "134": {
        "name": "奥林匹克公园",
        "edges": {
          "133": [{
            "line": 8,
            "sta": [134, 133],
            "dis": 1016,
            "dir": false
          }],
          "135": [{
            "line": 8,
            "sta": [134, 135],
            "dis": 1667,
            "dir": true
          }],
          "225": [{
            "line": 15,
            "sta": [134, 225],
            "dis": 1368,
            "dir": false
          }],
          "226": [{
            "line": 15,
            "sta": [134, 226],
            "dis": 1999,
            "dir": true
          }]
        }
      },
      "135": {
        "name": "奥体中心",
        "edges": {
          "134": [{
            "line": 8,
            "sta": [135, 134],
            "dis": 1667,
            "dir": false
          }],
          "136": [{
            "line": 8,
            "sta": [135, 136],
            "dis": 900,
            "dir": true
          }]
        }
      },
      "136": {
        "name": "北土城",
        "edges": {
          "135": [{
            "line": 8,
            "sta": [136, 135],
            "dis": 900,
            "dir": false
          }],
          "137": [{
            "line": 8,
            "sta": [136, 137],
            "dis": 1018,
            "dir": true
          }],
          "155": [{
            "line": 10,
            "sta": [136, 155],
            "dis": 1100,
            "dir": false
          }],
          "156": [{
            "line": 10,
            "sta": [136, 156],
            "dis": 1020,
            "dir": true
          }]
        }
      },
      "137": {
        "name": "安华桥",
        "edges": {
          "136": [{
            "line": 8,
            "sta": [137, 136],
            "dis": 1018,
            "dir": false
          }],
          "138": [{
            "line": 8,
            "sta": [137, 138],
            "dis": 1274,
            "dir": true
          }]
        }
      },
      "138": {
        "name": "安德里北街",
        "edges": {
          "137": [{
            "line": 8,
            "sta": [138, 137],
            "dis": 1274,
            "dir": false
          }],
          "26": [{
            "line": 8,
            "sta": [138, 26],
            "dis": 1083,
            "dir": true
          }]
        }
      },
      "139": {
        "name": "什刹海",
        "edges": {
          "26": [{
            "line": 8,
            "sta": [139, 26],
            "dis": 1188,
            "dir": false
          }],
          "87": [{
            "line": 8,
            "sta": [139, 87],
            "dis": 902,
            "dir": true
          }]
        }
      },
      "140": {
        "name": "郭公庄",
        "edges": {
          "141": [{
            "line": 9,
            "sta": [140, 141],
            "dis": 1347,
            "dir": false
          }],
          "391": [{
            "line": 95,
            "sta": [140, 391],
            "dis": 1138,
            "dir": false
          }],
          "260": [{
            "line": 95,
            "sta": [140, 260],
            "dis": 1405,
            "dir": true
          }]
        }
      },
      "141": {
        "name": "丰台科技园",
        "edges": {
          "142": [{
            "line": 9,
            "sta": [141, 142],
            "dis": 788,
            "dir": false
          }],
          "140": [{
            "line": 9,
            "sta": [141, 140],
            "dis": 1347,
            "dir": true
          }]
        }
      },
      "142": {
        "name": "科怡路",
        "edges": {
          "143": [{
            "line": 9,
            "sta": [142, 143],
            "dis": 980,
            "dir": false
          }],
          "141": [{
            "line": 9,
            "sta": [142, 141],
            "dis": 788,
            "dir": true
          }]
        }
      },
      "143": {
        "name": "丰台南路",
        "edges": {
          "144": [{
            "line": 9,
            "sta": [143, 144],
            "dis": 1585,
            "dir": false
          }],
          "142": [{
            "line": 9,
            "sta": [143, 142],
            "dis": 980,
            "dir": true
          }],
          "175": [{
            "line": 16,
            "sta": [143, 175],
            "dis": 1420,
            "dir": false
          }],
          "426": [{
            "line": 16,
            "sta": [143, 426],
            "dis": 1187,
            "dir": true
          }]
        }
      },
      "144": {
        "name": "丰台东大街",
        "edges": {
          "145": [{
            "line": 9,
            "sta": [144, 145],
            "dis": 1325,
            "dir": false
          }],
          "143": [{
            "line": 9,
            "sta": [144, 143],
            "dis": 1585,
            "dir": true
          }]
        }
      },
      "145": {
        "name": "七里庄",
        "edges": {
          "146": [{
            "line": 9,
            "sta": [145, 146],
            "dis": 1778,
            "dir": false
          }],
          "144": [{
            "line": 9,
            "sta": [145, 144],
            "dis": 1325,
            "dir": true
          }],
          "177": [{
            "line": 14,
            "sta": [145, 177],
            "dis": 845,
            "dir": false
          }],
          "197": [{
            "line": 14,
            "sta": [145, 197],
            "dis": 1579,
            "dir": true
          }]
        }
      },
      "146": {
        "name": "六里桥",
        "edges": {
          "147": [{
            "line": 9,
            "sta": [146, 147],
            "dis": 1309,
            "dir": false
          }],
          "145": [{
            "line": 9,
            "sta": [146, 145],
            "dis": 1778,
            "dir": true
          }],
          "177": [{
            "line": 90,
            "sta": [146, 177],
            "dis": 1584,
            "dir": false
          }],
          "178": [{
            "line": 90,
            "sta": [146, 178],
            "dis": 2392,
            "dir": true
          }]
        }
      },
      "147": {
        "name": "六里桥东",
        "edges": {
          "105": [{
            "line": 9,
            "sta": [147, 105],
            "dis": 1170,
            "dir": false
          }],
          "146": [{
            "line": 9,
            "sta": [147, 146],
            "dis": 1309,
            "dir": true
          }]
        }
      },
      "148": {
        "name": "白堆子",
        "edges": {
          "84": [{
            "line": 9,
            "sta": [148, 84],
            "dis": 943,
            "dir": false
          }],
          "9": [{
            "line": 9,
            "sta": [148, 9],
            "dis": 1912,
            "dir": true
          }]
        }
      },
      "149": {
        "name": "巴沟",
        "edges": {
          "150": [{
            "line": 10,
            "sta": [149, 150],
            "dis": 1110,
            "dir": true
          }],
          "182": [{
            "line": 90,
            "sta": [149, 182],
            "dis": 1495,
            "dir": false
          }]
        }
      },
      "150": {
        "name": "苏州街",
        "edges": {
          "149": [{
            "line": 10,
            "sta": [150, 149],
            "dis": 1110,
            "dir": false
          }],
          "54": [{
            "line": 10,
            "sta": [150, 54],
            "dis": 950,
            "dir": true
          }],
          "381": [{
            "line": 16,
            "sta": [150, 381],
            "dis": 1486,
            "dir": false
          }],
          "382": [{
            "line": 16,
            "sta": [150, 382],
            "dis": 1497,
            "dir": true
          }]
        }
      },
      "151": {
        "name": "知春里",
        "edges": {
          "54": [{
            "line": 10,
            "sta": [151, 54],
            "dis": 975,
            "dir": false
          }],
          "152": [{
            "line": 10,
            "sta": [151, 152],
            "dis": 1058,
            "dir": true
          }]
        }
      },
      "152": {
        "name": "知春路",
        "edges": {
          "151": [{
            "line": 10,
            "sta": [152, 151],
            "dis": 1058,
            "dir": false
          }],
          "153": [{
            "line": 10,
            "sta": [152, 153],
            "dis": 1101,
            "dir": true
          }],
          "183": [{
            "line": 13,
            "sta": [152, 183],
            "dis": 1206,
            "dir": false
          }],
          "184": [{
            "line": 13,
            "sta": [152, 184],
            "dis": 1829,
            "dir": true
          }]
        }
      },
      "153": {
        "name": "西土城",
        "edges": {
          "152": [{
            "line": 10,
            "sta": [153, 152],
            "dis": 1101,
            "dir": false
          }],
          "154": [{
            "line": 10,
            "sta": [153, 154],
            "dis": 1330,
            "dir": true
          }],
          "434": [{
            "line": 94,
            "sta": [153, 434],
            "dis": 1481,
            "dir": false
          }]
        }
      },
      "154": {
        "name": "牡丹园",
        "edges": {
          "153": [{
            "line": 10,
            "sta": [154, 153],
            "dis": 1330,
            "dir": false
          }],
          "155": [{
            "line": 10,
            "sta": [154, 155],
            "dis": 973,
            "dir": true
          }],
          "411": [{
            "line": 19,
            "sta": [154, 411],
            "dis": 920,
            "dir": true
          }]
        }
      },
      "155": {
        "name": "健德门",
        "edges": {
          "154": [{
            "line": 10,
            "sta": [155, 154],
            "dis": 973,
            "dir": false
          }],
          "136": [{
            "line": 10,
            "sta": [155, 136],
            "dis": 1100,
            "dir": true
          }]
        }
      },
      "156": {
        "name": "安贞门",
        "edges": {
          "136": [{
            "line": 10,
            "sta": [156, 136],
            "dis": 1020,
            "dir": false
          }],
          "72": [{
            "line": 10,
            "sta": [156, 72],
            "dis": 982,
            "dir": true
          }]
        }
      },
      "157": {
        "name": "芍药居",
        "edges": {
          "72": [{
            "line": 10,
            "sta": [157, 72],
            "dis": 1712,
            "dir": false
          }],
          "158": [{
            "line": 10,
            "sta": [157, 158],
            "dis": 1003,
            "dir": true
          }],
          "190": [{
            "line": 13,
            "sta": [157, 190],
            "dis": 2152,
            "dir": false
          }],
          "191": [{
            "line": 13,
            "sta": [157, 191],
            "dis": 1110,
            "dir": true
          }]
        }
      },
      "158": {
        "name": "太阳宫",
        "edges": {
          "157": [{
            "line": 10,
            "sta": [158, 157],
            "dis": 1003,
            "dir": false
          }],
          "159": [{
            "line": 10,
            "sta": [158, 159],
            "dis": 1759,
            "dir": true
          }],
          "2003": [{
            "line": 17,
            "sta": [158, 2003],
            "dis": 2500,
            "dir": false
          }],
          "448": [{
            "line": 17,
            "sta": [158, 448],
            "dis": 1207,
            "dir": true
          }]
        }
      },
      "159": {
        "name": "三元桥",
        "edges": {
          "158": [{
            "line": 10,
            "sta": [159, 158],
            "dis": 1759,
            "dir": false
          }],
          "160": [{
            "line": 10,
            "sta": [159, 160],
            "dis": 1506,
            "dir": true
          }]
        }
      },
      "160": {
        "name": "亮马桥",
        "edges": {
          "159": [{
            "line": 10,
            "sta": [160, 159],
            "dis": 1506,
            "dir": false
          }],
          "161": [{
            "line": 10,
            "sta": [160, 161],
            "dis": 914,
            "dir": true
          }]
        }
      },
      "161": {
        "name": "农业展览馆",
        "edges": {
          "160": [{
            "line": 10,
            "sta": [161, 160],
            "dis": 914,
            "dir": false
          }],
          "162": [{
            "line": 10,
            "sta": [161, 162],
            "dis": 853,
            "dir": true
          }]
        }
      },
      "162": {
        "name": "团结湖",
        "edges": {
          "161": [{
            "line": 10,
            "sta": [162, 161],
            "dis": 853,
            "dir": false
          }],
          "89": [{
            "line": 10,
            "sta": [162, 89],
            "dis": 1149,
            "dir": true
          }]
        }
      },
      "163": {
        "name": "金台夕照",
        "edges": {
          "89": [{
            "line": 10,
            "sta": [163, 89],
            "dis": 734,
            "dir": false
          }],
          "20": [{
            "line": 10,
            "sta": [163, 20],
            "dis": 835,
            "dir": true
          }]
        }
      },
      "164": {
        "name": "劲松",
        "edges": {
          "114": [{
            "line": 10,
            "sta": [164, 114],
            "dis": 1006,
            "dir": false
          }],
          "165": [{
            "line": 90,
            "sta": [164, 165],
            "dis": 1021,
            "dir": true
          }]
        }
      },
      "165": {
        "name": "潘家园",
        "edges": {
          "164": [{
            "line": 90,
            "sta": [165, 164],
            "dis": 1021,
            "dir": false
          }],
          "166": [{
            "line": 90,
            "sta": [165, 166],
            "dis": 1097,
            "dir": true
          }]
        }
      },
      "166": {
        "name": "十里河",
        "edges": {
          "1001": [{
            "line": 14,
            "sta": [166, 1001],
            "dis": 1147,
            "dir": false
          }],
          "200": [{
            "line": 14,
            "sta": [166, 200],
            "dis": 1618,
            "dir": true
          }],
          "406": [{
            "line": 17,
            "sta": [166, 406],
            "dis": 1672,
            "dir": true
          }],
          "165": [{
            "line": 90,
            "sta": [166, 165],
            "dis": 1097,
            "dir": false
          }],
          "167": [{
            "line": 90,
            "sta": [166, 167],
            "dis": 1804,
            "dir": true
          }]
        }
      },
      "167": {
        "name": "分钟寺",
        "edges": {
          "166": [{
            "line": 90,
            "sta": [167, 166],
            "dis": 1804,
            "dir": false
          }],
          "168": [{
            "line": 90,
            "sta": [167, 168],
            "dis": 1058,
            "dir": true
          }]
        }
      },
      "168": {
        "name": "成寿寺",
        "edges": {
          "167": [{
            "line": 90,
            "sta": [168, 167],
            "dis": 1058,
            "dir": false
          }],
          "61": [{
            "line": 90,
            "sta": [168, 61],
            "dis": 1677,
            "dir": true
          }]
        }
      },
      "169": {
        "name": "石榴庄",
        "edges": {
          "61": [{
            "line": 90,
            "sta": [169, 61],
            "dis": 1269,
            "dir": false
          }],
          "170": [{
            "line": 90,
            "sta": [169, 170],
            "dis": 1244,
            "dir": true
          }]
        }
      },
      "170": {
        "name": "大红门",
        "edges": {
          "318": [{
            "line": 8,
            "sta": [170, 318],
            "dis": 853,
            "dir": false
          }],
          "320": [{
            "line": 8,
            "sta": [170, 320],
            "dis": 825,
            "dir": true
          }],
          "169": [{
            "line": 90,
            "sta": [170, 169],
            "dis": 1244,
            "dir": false
          }],
          "171": [{
            "line": 90,
            "sta": [170, 171],
            "dis": 1130,
            "dir": true
          }]
        }
      },
      "171": {
        "name": "角门东",
        "edges": {
          "170": [{
            "line": 90,
            "sta": [171, 170],
            "dis": 1130,
            "dir": false
          }],
          "41": [{
            "line": 90,
            "sta": [171, 41],
            "dis": 1254,
            "dir": true
          }]
        }
      },
      "172": {
        "name": "草桥",
        "edges": {
          "416": [{
            "line": 19,
            "sta": [172, 416],
            "dis": 2680,
            "dir": false
          }],
          "415": [{
            "line": 19,
            "sta": [172, 415],
            "dis": 2650,
            "dir": true
          }],
          "41": [{
            "line": 90,
            "sta": [172, 41],
            "dis": 1688,
            "dir": false
          }],
          "173": [{
            "line": 90,
            "sta": [172, 173],
            "dis": 1547,
            "dir": true
          }]
        }
      },
      "173": {
        "name": "纪家庙",
        "edges": {
          "172": [{
            "line": 90,
            "sta": [173, 172],
            "dis": 1547,
            "dir": false
          }],
          "174": [{
            "line": 90,
            "sta": [173, 174],
            "dis": 1143,
            "dir": true
          }]
        }
      },
      "174": {
        "name": "首经贸",
        "edges": {
          "173": [{
            "line": 90,
            "sta": [174, 173],
            "dis": 1143,
            "dir": false
          }],
          "175": [{
            "line": 90,
            "sta": [174, 175],
            "dis": 1717,
            "dir": true
          }],
          "389": [{
            "line": 95,
            "sta": [174, 389],
            "dis": 1137,
            "dir": false
          }],
          "390": [{
            "line": 95,
            "sta": [174, 390],
            "dis": 1793,
            "dir": true
          }]
        }
      },
      "175": {
        "name": "丰台站",
        "edges": {
          "389": [{
            "line": 16,
            "sta": [175, 389],
            "dis": 1794,
            "dir": false
          }],
          "143": [{
            "line": 16,
            "sta": [175, 143],
            "dis": 1420,
            "dir": true
          }],
          "174": [{
            "line": 90,
            "sta": [175, 174],
            "dis": 1717,
            "dir": false
          }],
          "176": [{
            "line": 90,
            "sta": [175, 176],
            "dis": 954,
            "dir": true
          }]
        }
      },
      "176": {
        "name": "泥洼",
        "edges": {
          "175": [{
            "line": 90,
            "sta": [176, 175],
            "dis": 954,
            "dir": false
          }],
          "177": [{
            "line": 90,
            "sta": [176, 177],
            "dis": 749,
            "dir": true
          }]
        }
      },
      "177": {
        "name": "西局",
        "edges": {
          "400": [{
            "line": 14,
            "sta": [177, 400],
            "dis": 1489,
            "dir": false
          }],
          "145": [{
            "line": 14,
            "sta": [177, 145],
            "dis": 845,
            "dir": true
          }],
          "176": [{
            "line": 90,
            "sta": [177, 176],
            "dis": 749,
            "dir": false
          }],
          "146": [{
            "line": 90,
            "sta": [177, 146],
            "dis": 1584,
            "dir": true
          }]
        }
      },
      "178": {
        "name": "莲花桥",
        "edges": {
          "146": [{
            "line": 90,
            "sta": [178, 146],
            "dis": 2392,
            "dir": false
          }],
          "8": [{
            "line": 90,
            "sta": [178, 8],
            "dis": 1016,
            "dir": true
          }]
        }
      },
      "179": {
        "name": "西钓鱼台",
        "edges": {
          "8": [{
            "line": 90,
            "sta": [179, 8],
            "dis": 2386,
            "dir": false
          }],
          "82": [{
            "line": 90,
            "sta": [179, 82],
            "dis": 1214,
            "dir": true
          }]
        }
      },
      "180": {
        "name": "车道沟",
        "edges": {
          "82": [{
            "line": 90,
            "sta": [180, 82],
            "dis": 1590,
            "dir": false
          }],
          "181": [{
            "line": 90,
            "sta": [180, 181],
            "dis": 1205,
            "dir": true
          }]
        }
      },
      "181": {
        "name": "长春桥",
        "edges": {
          "180": [{
            "line": 90,
            "sta": [181, 180],
            "dis": 1205,
            "dir": false
          }],
          "182": [{
            "line": 90,
            "sta": [181, 182],
            "dis": 961,
            "dir": true
          }]
        }
      },
      "182": {
        "name": "火器营",
        "edges": {
          "181": [{
            "line": 90,
            "sta": [182, 181],
            "dis": 961,
            "dir": false
          }],
          "149": [{
            "line": 90,
            "sta": [182, 149],
            "dis": 1495,
            "dir": true
          }]
        }
      },
      "183": {
        "name": "大钟寺",
        "edges": {
          "24": [{
            "line": 13,
            "sta": [183, 24],
            "dis": 2839,
            "dir": false
          }],
          "152": [{
            "line": 13,
            "sta": [183, 152],
            "dis": 1206,
            "dir": true
          }]
        }
      },
      "184": {
        "name": "五道口",
        "edges": {
          "152": [{
            "line": 13,
            "sta": [184, 152],
            "dis": 1829,
            "dir": false
          }],
          "185": [{
            "line": 13,
            "sta": [184, 185],
            "dis": 4866,
            "dir": true
          }]
        }
      },
      "185": {
        "name": "上地",
        "edges": {
          "184": [{
            "line": 13,
            "sta": [185, 184],
            "dis": 4866,
            "dir": false
          }],
          "358": [{
            "line": 13,
            "sta": [185, 358],
            "dis": 1036,
            "dir": true
          }]
        }
      },
      "186": {
        "name": "西二旗",
        "edges": {
          "358": [{
            "line": 13,
            "sta": [186, 358],
            "dis": 1545,
            "dir": false
          }, {
            "line": 94,
            "sta": [186, 358],
            "dis": 1545,
            "dir": true
          }],
          "187": [{
            "line": 13,
            "sta": [186, 187],
            "dis": 3623,
            "dir": true
          }],
          "280": [{
            "line": 94,
            "sta": [186, 280],
            "dis": 5440,
            "dir": false
          }]
        }
      },
      "187": {
        "name": "龙泽",
        "edges": {
          "186": [{
            "line": 13,
            "sta": [187, 186],
            "dis": 3623,
            "dir": false
          }],
          "188": [{
            "line": 13,
            "sta": [187, 188],
            "dis": 1423,
            "dir": true
          }]
        }
      },
      "188": {
        "name": "回龙观",
        "edges": {
          "187": [{
            "line": 13,
            "sta": [188, 187],
            "dis": 1423,
            "dir": false
          }],
          "128": [{
            "line": 13,
            "sta": [188, 128],
            "dis": 2110,
            "dir": true
          }]
        }
      },
      "189": {
        "name": "北苑",
        "edges": {
          "77": [{
            "line": 13,
            "sta": [189, 77],
            "dis": 2272,
            "dir": false
          }],
          "190": [{
            "line": 13,
            "sta": [189, 190],
            "dis": 6720,
            "dir": true
          }]
        }
      },
      "190": {
        "name": "望京西",
        "edges": {
          "189": [{
            "line": 13,
            "sta": [190, 189],
            "dis": 6720,
            "dir": false
          }],
          "157": [{
            "line": 13,
            "sta": [190, 157],
            "dis": 2152,
            "dir": true
          }],
          "209": [{
            "line": 15,
            "sta": [190, 209],
            "dis": 1758,
            "dir": false
          }],
          "224": [{
            "line": 15,
            "sta": [190, 224],
            "dis": 2071,
            "dir": true
          }],
          "2003": [{
            "line": 1004,
            "sta": [190, 2003],
            "dis": 0,
            "dir": false
          }]
        }
      },
      "191": {
        "name": "光熙门",
        "edges": {
          "157": [{
            "line": 13,
            "sta": [191, 157],
            "dis": 1110,
            "dir": false
          }],
          "192": [{
            "line": 13,
            "sta": [191, 192],
            "dis": 1135,
            "dir": true
          }]
        }
      },
      "192": {
        "name": "柳芳",
        "edges": {
          "191": [{
            "line": 13,
            "sta": [192, 191],
            "dis": 1135,
            "dir": false
          }],
          "29": [{
            "line": 13,
            "sta": [192, 29],
            "dis": 1769,
            "dir": true
          }]
        }
      },
      "193": {
        "name": "张郭庄",
        "edges": {
          "194": [{
            "line": 14,
            "sta": [193, 194],
            "dis": 1345,
            "dir": false
          }]
        }
      },
      "194": {
        "name": "园博园",
        "edges": {
          "195": [{
            "line": 14,
            "sta": [194, 195],
            "dis": 4073,
            "dir": false
          }],
          "193": [{
            "line": 14,
            "sta": [194, 193],
            "dis": 1345,
            "dir": true
          }]
        }
      },
      "195": {
        "name": "大瓦窑",
        "edges": {
          "196": [{
            "line": 14,
            "sta": [195, 196],
            "dis": 1236,
            "dir": false
          }],
          "194": [{
            "line": 14,
            "sta": [195, 194],
            "dis": 4073,
            "dir": true
          }]
        }
      },
      "196": {
        "name": "郭庄子",
        "edges": {
          "197": [{
            "line": 14,
            "sta": [196, 197],
            "dis": 2044,
            "dir": false
          }],
          "195": [{
            "line": 14,
            "sta": [196, 195],
            "dis": 1236,
            "dir": true
          }]
        }
      },
      "197": {
        "name": "大井",
        "edges": {
          "145": [{
            "line": 14,
            "sta": [197, 145],
            "dis": 1579,
            "dir": false
          }],
          "196": [{
            "line": 14,
            "sta": [197, 196],
            "dis": 2044,
            "dir": true
          }]
        }
      },
      "198": {
        "name": "永定门外",
        "edges": {
          "317": [{
            "line": 8,
            "sta": [198, 317],
            "dis": 1800,
            "dir": false
          }],
          "319": [{
            "line": 8,
            "sta": [198, 319],
            "dis": 741,
            "dir": true
          }],
          "199": [{
            "line": 14,
            "sta": [198, 199],
            "dis": 1119,
            "dir": false
          }],
          "359": [{
            "line": 14,
            "sta": [198, 359],
            "dis": 1063,
            "dir": true
          }]
        }
      },
      "199": {
        "name": "景泰",
        "edges": {
          "63": [{
            "line": 14,
            "sta": [199, 63],
            "dis": 1025,
            "dir": false
          }],
          "198": [{
            "line": 14,
            "sta": [199, 198],
            "dis": 1119,
            "dir": true
          }]
        }
      },
      "200": {
        "name": "方庄",
        "edges": {
          "166": [{
            "line": 14,
            "sta": [200, 166],
            "dis": 1618,
            "dir": false
          }],
          "63": [{
            "line": 14,
            "sta": [200, 63],
            "dis": 1486,
            "dir": true
          }]
        }
      },
      "201": {
        "name": "北工大西门",
        "edges": {
          "202": [{
            "line": 14,
            "sta": [201, 202],
            "dis": 1128,
            "dir": false
          }],
          "1001": [{
            "line": 14,
            "sta": [201, 1001],
            "dis": 1276,
            "dir": true
          }]
        }
      },
      "202": {
        "name": "平乐园",
        "edges": {
          "115": [{
            "line": 14,
            "sta": [202, 115],
            "dis": 897,
            "dir": false
          }],
          "201": [{
            "line": 14,
            "sta": [202, 201],
            "dis": 1128,
            "dir": true
          }]
        }
      },
      "203": {
        "name": "朝阳公园",
        "edges": {
          "204": [{
            "line": 14,
            "sta": [203, 204],
            "dis": 1221,
            "dir": false
          }],
          "90": [{
            "line": 14,
            "sta": [203, 90],
            "dis": 1085,
            "dir": true
          }]
        }
      },
      "204": {
        "name": "枣营",
        "edges": {
          "205": [{
            "line": 14,
            "sta": [204, 205],
            "dis": 2173,
            "dir": false
          }],
          "203": [{
            "line": 14,
            "sta": [204, 203],
            "dis": 1221,
            "dir": true
          }]
        }
      },
      "205": {
        "name": "东风北桥",
        "edges": {
          "206": [{
            "line": 14,
            "sta": [205, 206],
            "dis": 1600,
            "dir": false
          }],
          "204": [{
            "line": 14,
            "sta": [205, 204],
            "dis": 2173,
            "dir": true
          }]
        }
      },
      "206": {
        "name": "将台",
        "edges": {
          "360": [{
            "line": 14,
            "sta": [206, 360],
            "dis": 1171,
            "dir": false
          }],
          "205": [{
            "line": 14,
            "sta": [206, 205],
            "dis": 1600,
            "dir": true
          }]
        }
      },
      "207": {
        "name": "望京南",
        "edges": {
          "208": [{
            "line": 14,
            "sta": [207, 208],
            "dis": 1168,
            "dir": false
          }],
          "360": [{
            "line": 14,
            "sta": [207, 360],
            "dis": 676,
            "dir": true
          }]
        }
      },
      "208": {
        "name": "阜通",
        "edges": {
          "209": [{
            "line": 14,
            "sta": [208, 209],
            "dis": 903,
            "dir": false
          }],
          "207": [{
            "line": 14,
            "sta": [208, 207],
            "dis": 1168,
            "dir": true
          }]
        }
      },
      "209": {
        "name": "望京",
        "edges": {
          "210": [{
            "line": 14,
            "sta": [209, 210],
            "dis": 1283,
            "dir": false
          }],
          "208": [{
            "line": 14,
            "sta": [209, 208],
            "dis": 903,
            "dir": true
          }],
          "223": [{
            "line": 15,
            "sta": [209, 223],
            "dis": 1652,
            "dir": false
          }],
          "190": [{
            "line": 15,
            "sta": [209, 190],
            "dis": 1758,
            "dir": true
          }]
        }
      },
      "210": {
        "name": "东湖渠",
        "edges": {
          "211": [{
            "line": 14,
            "sta": [210, 211],
            "dis": 1100,
            "dir": false
          }],
          "209": [{
            "line": 14,
            "sta": [210, 209],
            "dis": 1283,
            "dir": true
          }]
        }
      },
      "211": {
        "name": "来广营",
        "edges": {
          "212": [{
            "line": 14,
            "sta": [211, 212],
            "dis": 1364,
            "dir": false
          }],
          "210": [{
            "line": 14,
            "sta": [211, 210],
            "dis": 1100,
            "dir": true
          }]
        }
      },
      "212": {
        "name": "善各庄",
        "edges": {
          "211": [{
            "line": 14,
            "sta": [212, 211],
            "dis": 1364,
            "dir": true
          }]
        }
      },
      "213": {
        "name": "俸伯",
        "edges": {
          "214": [{
            "line": 15,
            "sta": [213, 214],
            "dis": 2441,
            "dir": true
          }]
        }
      },
      "214": {
        "name": "顺义",
        "edges": {
          "213": [{
            "line": 15,
            "sta": [214, 213],
            "dis": 2441,
            "dir": false
          }],
          "215": [{
            "line": 15,
            "sta": [214, 215],
            "dis": 1331,
            "dir": true
          }]
        }
      },
      "215": {
        "name": "石门",
        "edges": {
          "214": [{
            "line": 15,
            "sta": [215, 214],
            "dis": 1331,
            "dir": false
          }],
          "216": [{
            "line": 15,
            "sta": [215, 216],
            "dis": 2712,
            "dir": true
          }]
        }
      },
      "216": {
        "name": "南法信",
        "edges": {
          "215": [{
            "line": 15,
            "sta": [216, 215],
            "dis": 2712,
            "dir": false
          }],
          "217": [{
            "line": 15,
            "sta": [216, 217],
            "dis": 4576,
            "dir": true
          }]
        }
      },
      "217": {
        "name": "后沙峪",
        "edges": {
          "216": [{
            "line": 15,
            "sta": [217, 216],
            "dis": 4576,
            "dir": false
          }],
          "218": [{
            "line": 15,
            "sta": [217, 218],
            "dis": 3354,
            "dir": true
          }]
        }
      },
      "218": {
        "name": "花梨坎",
        "edges": {
          "217": [{
            "line": 15,
            "sta": [218, 217],
            "dis": 3354,
            "dir": false
          }],
          "219": [{
            "line": 15,
            "sta": [218, 219],
            "dis": 1615,
            "dir": true
          }]
        }
      },
      "219": {
        "name": "国展",
        "edges": {
          "218": [{
            "line": 15,
            "sta": [219, 218],
            "dis": 1615,
            "dir": false
          }],
          "220": [{
            "line": 15,
            "sta": [219, 220],
            "dis": 3386,
            "dir": true
          }]
        }
      },
      "220": {
        "name": "孙河",
        "edges": {
          "219": [{
            "line": 15,
            "sta": [220, 219],
            "dis": 3386,
            "dir": false
          }],
          "221": [{
            "line": 15,
            "sta": [220, 221],
            "dis": 3309,
            "dir": true
          }]
        }
      },
      "221": {
        "name": "马泉营",
        "edges": {
          "220": [{
            "line": 15,
            "sta": [221, 220],
            "dis": 3309,
            "dir": false
          }],
          "222": [{
            "line": 15,
            "sta": [221, 222],
            "dis": 2008,
            "dir": true
          }]
        }
      },
      "222": {
        "name": "崔各庄",
        "edges": {
          "221": [{
            "line": 15,
            "sta": [222, 221],
            "dis": 2008,
            "dir": false
          }],
          "223": [{
            "line": 15,
            "sta": [222, 223],
            "dis": 2295,
            "dir": true
          }]
        }
      },
      "223": {
        "name": "望京东",
        "edges": {
          "222": [{
            "line": 15,
            "sta": [223, 222],
            "dis": 2295,
            "dir": false
          }],
          "209": [{
            "line": 15,
            "sta": [223, 209],
            "dis": 1652,
            "dir": true
          }]
        }
      },
      "224": {
        "name": "关庄",
        "edges": {
          "190": [{
            "line": 15,
            "sta": [224, 190],
            "dis": 2071,
            "dir": false
          }],
          "74": [{
            "line": 15,
            "sta": [224, 74],
            "dis": 1087,
            "dir": true
          }]
        }
      },
      "225": {
        "name": "安立路",
        "edges": {
          "74": [{
            "line": 15,
            "sta": [225, 74],
            "dis": 938,
            "dir": false
          }],
          "134": [{
            "line": 15,
            "sta": [225, 134],
            "dis": 1368,
            "dir": true
          }]
        }
      },
      "226": {
        "name": "北沙滩",
        "edges": {
          "134": [{
            "line": 15,
            "sta": [226, 134],
            "dis": 1999,
            "dir": false
          }],
          "227": [{
            "line": 15,
            "sta": [226, 227],
            "dis": 1337,
            "dir": true
          }]
        }
      },
      "227": {
        "name": "六道口",
        "edges": {
          "226": [{
            "line": 15,
            "sta": [227, 226],
            "dis": 1337,
            "dir": false
          }],
          "228": [{
            "line": 15,
            "sta": [227, 228],
            "dis": 1144,
            "dir": true
          }],
          "439": [{
            "line": 94,
            "sta": [227, 439],
            "dis": 1683,
            "dir": false
          }],
          "434": [{
            "line": 94,
            "sta": [227, 434],
            "dis": 1312,
            "dir": true
          }]
        }
      },
      "228": {
        "name": "清华东路西口",
        "edges": {
          "227": [{
            "line": 15,
            "sta": [228, 227],
            "dis": 1144,
            "dir": false
          }]
        }
      },
      "229": {
        "name": "农大南路",
        "edges": {
          "230": [{
            "line": 16,
            "sta": [229, 230],
            "dis": 1517,
            "dir": false
          }],
          "58": [{
            "line": 16,
            "sta": [229, 58],
            "dis": 2690,
            "dir": true
          }]
        }
      },
      "230": {
        "name": "马连洼",
        "edges": {
          "231": [{
            "line": 16,
            "sta": [230, 231],
            "dis": 2196,
            "dir": false
          }],
          "229": [{
            "line": 16,
            "sta": [230, 229],
            "dis": 1517,
            "dir": true
          }]
        }
      },
      "231": {
        "name": "西北旺",
        "edges": {
          "232": [{
            "line": 16,
            "sta": [231, 232],
            "dis": 2108,
            "dir": false
          }],
          "230": [{
            "line": 16,
            "sta": [231, 230],
            "dis": 2196,
            "dir": true
          }]
        }
      },
      "232": {
        "name": "永丰南",
        "edges": {
          "233": [{
            "line": 16,
            "sta": [232, 233],
            "dis": 1315,
            "dir": false
          }],
          "231": [{
            "line": 16,
            "sta": [232, 231],
            "dis": 2108,
            "dir": true
          }]
        }
      },
      "233": {
        "name": "永丰",
        "edges": {
          "234": [{
            "line": 16,
            "sta": [233, 234],
            "dis": 1961,
            "dir": false
          }],
          "232": [{
            "line": 16,
            "sta": [233, 232],
            "dis": 1315,
            "dir": true
          }]
        }
      },
      "234": {
        "name": "屯佃",
        "edges": {
          "235": [{
            "line": 16,
            "sta": [234, 235],
            "dis": 2352,
            "dir": false
          }],
          "233": [{
            "line": 16,
            "sta": [234, 233],
            "dis": 1961,
            "dir": true
          }]
        }
      },
      "235": {
        "name": "稻香湖路",
        "edges": {
          "236": [{
            "line": 16,
            "sta": [235, 236],
            "dis": 2310,
            "dir": false
          }],
          "234": [{
            "line": 16,
            "sta": [235, 234],
            "dis": 2352,
            "dir": true
          }]
        }
      },
      "236": {
        "name": "温阳路",
        "edges": {
          "237": [{
            "line": 16,
            "sta": [236, 237],
            "dis": 2653,
            "dir": false
          }],
          "235": [{
            "line": 16,
            "sta": [236, 235],
            "dis": 2310,
            "dir": true
          }]
        }
      },
      "237": {
        "name": "北安河",
        "edges": {
          "236": [{
            "line": 16,
            "sta": [237, 236],
            "dis": 2653,
            "dir": true
          }]
        }
      },
      "238": {
        "name": "高碑店",
        "edges": {
          "239": [{
            "line": 97,
            "sta": [238, 239],
            "dis": 2002,
            "dir": false
          }],
          "23": [{
            "line": 97,
            "sta": [238, 23],
            "dis": 1375,
            "dir": true
          }]
        }
      },
      "239": {
        "name": "传媒大学",
        "edges": {
          "240": [{
            "line": 97,
            "sta": [239, 240],
            "dis": 1894,
            "dir": false
          }],
          "238": [{
            "line": 97,
            "sta": [239, 238],
            "dis": 2002,
            "dir": true
          }]
        }
      },
      "240": {
        "name": "双桥",
        "edges": {
          "241": [{
            "line": 97,
            "sta": [240, 241],
            "dis": 1912,
            "dir": false
          }],
          "239": [{
            "line": 97,
            "sta": [240, 239],
            "dis": 1894,
            "dir": true
          }]
        }
      },
      "241": {
        "name": "管庄",
        "edges": {
          "242": [{
            "line": 97,
            "sta": [241, 242],
            "dis": 1763,
            "dir": false
          }],
          "240": [{
            "line": 97,
            "sta": [241, 240],
            "dis": 1912,
            "dir": true
          }]
        }
      },
      "242": {
        "name": "八里桥",
        "edges": {
          "243": [{
            "line": 97,
            "sta": [242, 243],
            "dis": 1700,
            "dir": false
          }],
          "241": [{
            "line": 97,
            "sta": [242, 241],
            "dis": 1763,
            "dir": true
          }]
        }
      },
      "243": {
        "name": "通州北苑",
        "edges": {
          "244": [{
            "line": 97,
            "sta": [243, 244],
            "dis": 1465,
            "dir": false
          }],
          "242": [{
            "line": 97,
            "sta": [243, 242],
            "dis": 1700,
            "dir": true
          }]
        }
      },
      "244": {
        "name": "果园",
        "edges": {
          "245": [{
            "line": 97,
            "sta": [244, 245],
            "dis": 990,
            "dir": false
          }],
          "243": [{
            "line": 97,
            "sta": [244, 243],
            "dis": 1465,
            "dir": true
          }]
        }
      },
      "245": {
        "name": "九棵树",
        "edges": {
          "246": [{
            "line": 97,
            "sta": [245, 246],
            "dis": 1225,
            "dir": false
          }],
          "244": [{
            "line": 97,
            "sta": [245, 244],
            "dis": 990,
            "dir": true
          }]
        }
      },
      "246": {
        "name": "梨园",
        "edges": {
          "247": [{
            "line": 97,
            "sta": [246, 247],
            "dis": 1257,
            "dir": false
          }],
          "245": [{
            "line": 97,
            "sta": [246, 245],
            "dis": 1225,
            "dir": true
          }]
        }
      },
      "247": {
        "name": "临河里",
        "edges": {
          "248": [{
            "line": 97,
            "sta": [247, 248],
            "dis": 776,
            "dir": false
          }],
          "246": [{
            "line": 97,
            "sta": [247, 246],
            "dis": 1257,
            "dir": true
          }]
        }
      },
      "248": {
        "name": "土桥",
        "edges": {
          "356": [{
            "line": 97,
            "sta": [248, 356],
            "dis": 2238,
            "dir": false
          }],
          "247": [{
            "line": 97,
            "sta": [248, 247],
            "dis": 776,
            "dir": true
          }]
        }
      },
      "249": {
        "name": "天宫院",
        "edges": {
          "250": [{
            "line": 93,
            "sta": [249, 250],
            "dis": 1811,
            "dir": false
          }]
        }
      },
      "250": {
        "name": "生物医药基地",
        "edges": {
          "251": [{
            "line": 93,
            "sta": [250, 251],
            "dis": 2918,
            "dir": false
          }],
          "249": [{
            "line": 93,
            "sta": [250, 249],
            "dis": 1811,
            "dir": true
          }]
        }
      },
      "251": {
        "name": "义和庄",
        "edges": {
          "252": [{
            "line": 93,
            "sta": [251, 252],
            "dis": 2035,
            "dir": false
          }],
          "250": [{
            "line": 93,
            "sta": [251, 250],
            "dis": 2918,
            "dir": true
          }]
        }
      },
      "252": {
        "name": "黄村火车站",
        "edges": {
          "253": [{
            "line": 93,
            "sta": [252, 253],
            "dis": 987,
            "dir": false
          }],
          "251": [{
            "line": 93,
            "sta": [252, 251],
            "dis": 2035,
            "dir": true
          }]
        }
      },
      "253": {
        "name": "黄村西大街",
        "edges": {
          "254": [{
            "line": 93,
            "sta": [253, 254],
            "dis": 1214,
            "dir": false
          }],
          "252": [{
            "line": 93,
            "sta": [253, 252],
            "dis": 987,
            "dir": true
          }]
        }
      },
      "254": {
        "name": "清源路",
        "edges": {
          "255": [{
            "line": 93,
            "sta": [254, 255],
            "dis": 1200,
            "dir": false
          }],
          "253": [{
            "line": 93,
            "sta": [254, 253],
            "dis": 1214,
            "dir": true
          }]
        }
      },
      "255": {
        "name": "枣园",
        "edges": {
          "256": [{
            "line": 93,
            "sta": [255, 256],
            "dis": 1096,
            "dir": false
          }],
          "254": [{
            "line": 93,
            "sta": [255, 254],
            "dis": 1200,
            "dir": true
          }]
        }
      },
      "256": {
        "name": "高米店南",
        "edges": {
          "257": [{
            "line": 93,
            "sta": [256, 257],
            "dis": 1128,
            "dir": false
          }],
          "255": [{
            "line": 93,
            "sta": [256, 255],
            "dis": 1096,
            "dir": true
          }]
        }
      },
      "257": {
        "name": "高米店北",
        "edges": {
          "258": [{
            "line": 93,
            "sta": [257, 258],
            "dis": 1810,
            "dir": false
          }],
          "256": [{
            "line": 93,
            "sta": [257, 256],
            "dis": 1128,
            "dir": true
          }]
        }
      },
      "258": {
        "name": "西红门",
        "edges": {
          "259": [{
            "line": 93,
            "sta": [258, 259],
            "dis": 5102,
            "dir": false
          }],
          "257": [{
            "line": 93,
            "sta": [258, 257],
            "dis": 1810,
            "dir": true
          }]
        }
      },
      "259": {
        "name": "新宫",
        "edges": {
          "415": [{
            "line": 19,
            "sta": [259, 415],
            "dis": 2740,
            "dir": false
          }],
          "40": [{
            "line": 93,
            "sta": [259, 40],
            "dis": 2798,
            "dir": false
          }],
          "258": [{
            "line": 93,
            "sta": [259, 258],
            "dis": 5102,
            "dir": true
          }]
        }
      },
      "260": {
        "name": "大葆台",
        "edges": {
          "140": [{
            "line": 95,
            "sta": [260, 140],
            "dis": 1405,
            "dir": true
          }],
          "261": [{
            "line": 95,
            "sta": [260, 261],
            "dis": 6466,
            "dir": true
          }]
        }
      },
      "261": {
        "name": "稻田",
        "edges": {
          "260": [{
            "line": 95,
            "sta": [261, 260],
            "dis": 6466,
            "dir": true
          }],
          "262": [{
            "line": 95,
            "sta": [261, 262],
            "dis": 4041,
            "dir": true
          }]
        }
      },
      "262": {
        "name": "长阳",
        "edges": {
          "261": [{
            "line": 95,
            "sta": [262, 261],
            "dis": 4041,
            "dir": true
          }],
          "263": [{
            "line": 95,
            "sta": [262, 263],
            "dis": 2150,
            "dir": true
          }]
        }
      },
      "263": {
        "name": "篱笆房",
        "edges": {
          "262": [{
            "line": 95,
            "sta": [263, 262],
            "dis": 2150,
            "dir": true
          }],
          "264": [{
            "line": 95,
            "sta": [263, 264],
            "dis": 1474,
            "dir": true
          }]
        }
      },
      "264": {
        "name": "广阳城",
        "edges": {
          "263": [{
            "line": 95,
            "sta": [264, 263],
            "dis": 1474,
            "dir": true
          }],
          "265": [{
            "line": 95,
            "sta": [264, 265],
            "dis": 2003,
            "dir": true
          }]
        }
      },
      "265": {
        "name": "良乡大学城北",
        "edges": {
          "264": [{
            "line": 95,
            "sta": [265, 264],
            "dis": 2003,
            "dir": true
          }],
          "266": [{
            "line": 95,
            "sta": [265, 266],
            "dis": 1188,
            "dir": true
          }]
        }
      },
      "266": {
        "name": "良乡大学城",
        "edges": {
          "265": [{
            "line": 95,
            "sta": [266, 265],
            "dis": 1188,
            "dir": true
          }],
          "267": [{
            "line": 95,
            "sta": [266, 267],
            "dis": 1738,
            "dir": true
          }]
        }
      },
      "267": {
        "name": "良乡大学城西",
        "edges": {
          "266": [{
            "line": 95,
            "sta": [267, 266],
            "dis": 1738,
            "dir": true
          }],
          "268": [{
            "line": 95,
            "sta": [267, 268],
            "dis": 1332,
            "dir": true
          }]
        }
      },
      "268": {
        "name": "良乡南关",
        "edges": {
          "267": [{
            "line": 95,
            "sta": [268, 267],
            "dis": 1332,
            "dir": true
          }],
          "269": [{
            "line": 95,
            "sta": [268, 269],
            "dis": 1330,
            "dir": true
          }]
        }
      },
      "269": {
        "name": "苏庄",
        "edges": {
          "268": [{
            "line": 95,
            "sta": [269, 268],
            "dis": 1330,
            "dir": true
          }],
          "270": [{
            "line": 95,
            "sta": [269, 270],
            "dis": 2200,
            "dir": true
          }]
        }
      },
      "270": {
        "name": "阎村东",
        "edges": {
          "294": [{
            "line": 92,
            "sta": [270, 294],
            "dis": 1541,
            "dir": true
          }],
          "269": [{
            "line": 95,
            "sta": [270, 269],
            "dis": 2200,
            "dir": true
          }]
        }
      },
      "271": {
        "name": "昌平西山口",
        "edges": {
          "272": [{
            "line": 94,
            "sta": [271, 272],
            "dis": 1213,
            "dir": true
          }]
        }
      },
      "272": {
        "name": "十三陵景区",
        "edges": {
          "271": [{
            "line": 94,
            "sta": [272, 271],
            "dis": 1213,
            "dir": false
          }],
          "273": [{
            "line": 94,
            "sta": [272, 273],
            "dis": 3508,
            "dir": true
          }]
        }
      },
      "273": {
        "name": "昌平",
        "edges": {
          "272": [{
            "line": 94,
            "sta": [273, 272],
            "dis": 3508,
            "dir": false
          }],
          "274": [{
            "line": 94,
            "sta": [273, 274],
            "dis": 2433,
            "dir": true
          }]
        }
      },
      "274": {
        "name": "昌平东关",
        "edges": {
          "273": [{
            "line": 94,
            "sta": [274, 273],
            "dis": 2433,
            "dir": false
          }],
          "275": [{
            "line": 94,
            "sta": [274, 275],
            "dis": 1683,
            "dir": true
          }]
        }
      },
      "275": {
        "name": "北邵洼",
        "edges": {
          "274": [{
            "line": 94,
            "sta": [275, 274],
            "dis": 1683,
            "dir": false
          }],
          "276": [{
            "line": 94,
            "sta": [275, 276],
            "dis": 1958,
            "dir": true
          }]
        }
      },
      "276": {
        "name": "南邵",
        "edges": {
          "275": [{
            "line": 94,
            "sta": [276, 275],
            "dis": 1958,
            "dir": false
          }],
          "277": [{
            "line": 94,
            "sta": [276, 277],
            "dis": 5357,
            "dir": true
          }]
        }
      },
      "277": {
        "name": "沙河高教园",
        "edges": {
          "276": [{
            "line": 94,
            "sta": [277, 276],
            "dis": 5357,
            "dir": false
          }],
          "278": [{
            "line": 94,
            "sta": [277, 278],
            "dis": 1964,
            "dir": true
          }]
        }
      },
      "278": {
        "name": "沙河",
        "edges": {
          "277": [{
            "line": 94,
            "sta": [278, 277],
            "dis": 1964,
            "dir": false
          }],
          "279": [{
            "line": 94,
            "sta": [278, 279],
            "dis": 2025,
            "dir": true
          }]
        }
      },
      "279": {
        "name": "巩华城",
        "edges": {
          "278": [{
            "line": 94,
            "sta": [279, 278],
            "dis": 2025,
            "dir": false
          }],
          "124": [{
            "line": 94,
            "sta": [279, 124],
            "dis": 3799,
            "dir": true
          }]
        }
      },
      "280": {
        "name": "生命科学园",
        "edges": {
          "124": [{
            "line": 94,
            "sta": [280, 124],
            "dis": 2367,
            "dir": false
          }],
          "186": [{
            "line": 94,
            "sta": [280, 186],
            "dis": 5440,
            "dir": true
          }]
        }
      },
      "281": {
        "name": "肖村",
        "edges": {
          "61": [{
            "line": 96,
            "sta": [281, 61],
            "dis": 2631,
            "dir": false
          }],
          "282": [{
            "line": 96,
            "sta": [281, 282],
            "dis": 1275,
            "dir": true
          }]
        }
      },
      "282": {
        "name": "小红门",
        "edges": {
          "281": [{
            "line": 96,
            "sta": [282, 281],
            "dis": 1275,
            "dir": false
          }],
          "283": [{
            "line": 96,
            "sta": [282, 283],
            "dis": 2366,
            "dir": true
          }]
        }
      },
      "283": {
        "name": "旧宫",
        "edges": {
          "282": [{
            "line": 96,
            "sta": [283, 282],
            "dis": 2366,
            "dir": false
          }],
          "284": [{
            "line": 96,
            "sta": [283, 284],
            "dis": 1982,
            "dir": true
          }]
        }
      },
      "284": {
        "name": "亦庄桥",
        "edges": {
          "283": [{
            "line": 96,
            "sta": [284, 283],
            "dis": 1982,
            "dir": false
          }],
          "285": [{
            "line": 96,
            "sta": [284, 285],
            "dis": 993,
            "dir": true
          }]
        }
      },
      "285": {
        "name": "亦庄文化园",
        "edges": {
          "284": [{
            "line": 96,
            "sta": [285, 284],
            "dis": 993,
            "dir": false
          }],
          "286": [{
            "line": 96,
            "sta": [285, 286],
            "dis": 1728,
            "dir": true
          }]
        }
      },
      "286": {
        "name": "万源街",
        "edges": {
          "285": [{
            "line": 96,
            "sta": [286, 285],
            "dis": 1728,
            "dir": false
          }],
          "287": [{
            "line": 96,
            "sta": [286, 287],
            "dis": 1090,
            "dir": true
          }]
        }
      },
      "287": {
        "name": "荣京东街",
        "edges": {
          "286": [{
            "line": 96,
            "sta": [287, 286],
            "dis": 1090,
            "dir": false
          }],
          "288": [{
            "line": 96,
            "sta": [287, 288],
            "dis": 1355,
            "dir": true
          }]
        }
      },
      "288": {
        "name": "荣昌东街",
        "edges": {
          "287": [{
            "line": 96,
            "sta": [288, 287],
            "dis": 1355,
            "dir": false
          }],
          "289": [{
            "line": 96,
            "sta": [288, 289],
            "dis": 2337,
            "dir": true
          }]
        }
      },
      "289": {
        "name": "同济南路",
        "edges": {
          "288": [{
            "line": 96,
            "sta": [289, 288],
            "dis": 2337,
            "dir": false
          }],
          "290": [{
            "line": 96,
            "sta": [289, 290],
            "dis": 2301,
            "dir": true
          }]
        }
      },
      "290": {
        "name": "经海路",
        "edges": {
          "289": [{
            "line": 96,
            "sta": [290, 289],
            "dis": 2301,
            "dir": false
          }],
          "291": [{
            "line": 96,
            "sta": [290, 291],
            "dis": 2055,
            "dir": true
          }]
        }
      },
      "291": {
        "name": "次渠南",
        "edges": {
          "290": [{
            "line": 96,
            "sta": [291, 290],
            "dis": 2055,
            "dir": false
          }],
          "292": [{
            "line": 96,
            "sta": [291, 292],
            "dis": 1281,
            "dir": true
          }]
        }
      },
      "292": {
        "name": "次渠",
        "edges": {
          "409": [{
            "line": 17,
            "sta": [292, 409],
            "dis": 1455,
            "dir": false
          }],
          "410": [{
            "line": 17,
            "sta": [292, 410],
            "dis": 2125,
            "dir": true
          }],
          "291": [{
            "line": 96,
            "sta": [292, 291],
            "dis": 1281,
            "dir": false
          }],
          "293": [{
            "line": 96,
            "sta": [292, 293],
            "dis": 1334,
            "dir": true
          }]
        }
      },
      "293": {
        "name": "亦庄火车站",
        "edges": {
          "292": [{
            "line": 96,
            "sta": [293, 292],
            "dis": 1334,
            "dir": false
          }]
        }
      },
      "294": {
        "name": "紫草坞",
        "edges": {
          "270": [{
            "line": 92,
            "sta": [294, 270],
            "dis": 1541,
            "dir": false
          }],
          "295": [{
            "line": 92,
            "sta": [294, 295],
            "dis": 1210,
            "dir": true
          }]
        }
      },
      "295": {
        "name": "阎村",
        "edges": {
          "294": [{
            "line": 92,
            "sta": [295, 294],
            "dis": 1210,
            "dir": false
          }],
          "296": [{
            "line": 92,
            "sta": [295, 296],
            "dis": 1649,
            "dir": true
          }]
        }
      },
      "296": {
        "name": "星城",
        "edges": {
          "295": [{
            "line": 92,
            "sta": [296, 295],
            "dis": 1649,
            "dir": false
          }],
          "297": [{
            "line": 92,
            "sta": [296, 297],
            "dis": 1929,
            "dir": true
          }]
        }
      },
      "297": {
        "name": "大石河东",
        "edges": {
          "296": [{
            "line": 92,
            "sta": [297, 296],
            "dis": 1929,
            "dir": false
          }],
          "298": [{
            "line": 92,
            "sta": [297, 298],
            "dis": 2087,
            "dir": true
          }]
        }
      },
      "298": {
        "name": "马各庄",
        "edges": {
          "297": [{
            "line": 92,
            "sta": [298, 297],
            "dis": 2087,
            "dir": false
          }],
          "299": [{
            "line": 92,
            "sta": [298, 299],
            "dis": 984,
            "dir": true
          }]
        }
      },
      "299": {
        "name": "饶乐府",
        "edges": {
          "298": [{
            "line": 92,
            "sta": [299, 298],
            "dis": 984,
            "dir": false
          }],
          "300": [{
            "line": 92,
            "sta": [299, 300],
            "dis": 1777,
            "dir": true
          }]
        }
      },
      "300": {
        "name": "房山城关",
        "edges": {
          "299": [{
            "line": 92,
            "sta": [300, 299],
            "dis": 1777,
            "dir": false
          }],
          "301": [{
            "line": 92,
            "sta": [300, 301],
            "dis": 2076,
            "dir": true
          }]
        }
      },
      "301": {
        "name": "燕山",
        "edges": {
          "300": [{
            "line": 92,
            "sta": [301, 300],
            "dis": 2076,
            "dir": false
          }]
        }
      },
      "302": {
        "name": "金安桥",
        "edges": {
          "1": [{
            "line": 6,
            "sta": [302, 1],
            "dis": 1438,
            "dir": false
          }, {
            "line": 91,
            "sta": [302, 1],
            "dis": 1419,
            "dir": false
          }],
          "417": [{
            "line": 11,
            "sta": [302, 417],
            "dis": 1366,
            "dir": false
          }],
          "398": [{
            "line": 11,
            "sta": [302, 398],
            "dis": 850,
            "dir": true
          }],
          "303": [{
            "line": 91,
            "sta": [302, 303],
            "dis": 2710,
            "dir": true
          }]
        }
      },
      "303": {
        "name": "四道桥",
        "edges": {
          "302": [{
            "line": 91,
            "sta": [303, 302],
            "dis": 2710,
            "dir": false
          }],
          "304": [{
            "line": 91,
            "sta": [303, 304],
            "dis": 834,
            "dir": true
          }]
        }
      },
      "304": {
        "name": "桥户营",
        "edges": {
          "303": [{
            "line": 91,
            "sta": [304, 303],
            "dis": 834,
            "dir": false
          }],
          "305": [{
            "line": 91,
            "sta": [304, 305],
            "dis": 1065,
            "dir": true
          }]
        }
      },
      "305": {
        "name": "上岸",
        "edges": {
          "304": [{
            "line": 91,
            "sta": [305, 304],
            "dis": 1065,
            "dir": false
          }],
          "306": [{
            "line": 91,
            "sta": [305, 306],
            "dis": 1044,
            "dir": true
          }]
        }
      },
      "306": {
        "name": "栗园庄",
        "edges": {
          "305": [{
            "line": 91,
            "sta": [306, 305],
            "dis": 1044,
            "dir": false
          }],
          "307": [{
            "line": 91,
            "sta": [306, 307],
            "dis": 1266,
            "dir": true
          }]
        }
      },
      "307": {
        "name": "小园",
        "edges": {
          "306": [{
            "line": 91,
            "sta": [307, 306],
            "dis": 1266,
            "dir": false
          }],
          "308": [{
            "line": 91,
            "sta": [307, 308],
            "dis": 1297,
            "dir": true
          }]
        }
      },
      "308": {
        "name": "石厂",
        "edges": {
          "307": [{
            "line": 91,
            "sta": [308, 307],
            "dis": 1297,
            "dir": false
          }]
        }
      },
      "316": {
        "name": "中国美术馆",
        "edges": {
          "87": [{
            "line": 8,
            "sta": [316, 87],
            "dis": 1437,
            "dir": false
          }],
          "395": [{
            "line": 8,
            "sta": [316, 395],
            "dis": 873,
            "dir": true
          }]
        }
      },
      "317": {
        "name": "天桥",
        "edges": {
          "110": [{
            "line": 8,
            "sta": [317, 110],
            "dis": 881,
            "dir": false
          }],
          "198": [{
            "line": 8,
            "sta": [317, 198],
            "dis": 1800,
            "dir": true
          }]
        }
      },
      "318": {
        "name": "海户屯",
        "edges": {
          "319": [{
            "line": 8,
            "sta": [318, 319],
            "dis": 845,
            "dir": false
          }],
          "170": [{
            "line": 8,
            "sta": [318, 170],
            "dis": 853,
            "dir": true
          }]
        }
      },
      "319": {
        "name": "木樨园",
        "edges": {
          "198": [{
            "line": 8,
            "sta": [319, 198],
            "dis": 741,
            "dir": false
          }],
          "318": [{
            "line": 8,
            "sta": [319, 318],
            "dis": 845,
            "dir": true
          }]
        }
      },
      "320": {
        "name": "大红门南",
        "edges": {
          "170": [{
            "line": 8,
            "sta": [320, 170],
            "dis": 825,
            "dir": false
          }],
          "321": [{
            "line": 8,
            "sta": [320, 321],
            "dis": 2446,
            "dir": true
          }]
        }
      },
      "321": {
        "name": "和义",
        "edges": {
          "320": [{
            "line": 8,
            "sta": [321, 320],
            "dis": 2446,
            "dir": false
          }],
          "322": [{
            "line": 8,
            "sta": [321, 322],
            "dis": 1537,
            "dir": true
          }]
        }
      },
      "322": {
        "name": "东高地",
        "edges": {
          "321": [{
            "line": 8,
            "sta": [322, 321],
            "dis": 1537,
            "dir": false
          }],
          "323": [{
            "line": 8,
            "sta": [322, 323],
            "dis": 1215,
            "dir": true
          }]
        }
      },
      "323": {
        "name": "火箭万源",
        "edges": {
          "322": [{
            "line": 8,
            "sta": [323, 322],
            "dis": 1215,
            "dir": false
          }],
          "324": [{
            "line": 8,
            "sta": [323, 324],
            "dis": 1684,
            "dir": true
          }]
        }
      },
      "324": {
        "name": "五福堂",
        "edges": {
          "323": [{
            "line": 8,
            "sta": [324, 323],
            "dis": 1684,
            "dir": false
          }],
          "325": [{
            "line": 8,
            "sta": [324, 325],
            "dis": 2076,
            "dir": true
          }]
        }
      },
      "325": {
        "name": "德茂",
        "edges": {
          "324": [{
            "line": 8,
            "sta": [325, 324],
            "dis": 2076,
            "dir": false
          }],
          "326": [{
            "line": 8,
            "sta": [325, 326],
            "dis": 1510,
            "dir": true
          }]
        }
      },
      "326": {
        "name": "瀛海",
        "edges": {
          "325": [{
            "line": 8,
            "sta": [326, 325],
            "dis": 1510,
            "dir": false
          }]
        }
      },
      "327": {
        "name": "田村",
        "edges": {
          "81": [{
            "line": 6,
            "sta": [327, 81],
            "dis": 2140,
            "dir": false
          }],
          "328": [{
            "line": 6,
            "sta": [327, 328],
            "dis": 2276,
            "dir": true
          }]
        }
      },
      "328": {
        "name": "廖公庄",
        "edges": {
          "327": [{
            "line": 6,
            "sta": [328, 327],
            "dis": 2276,
            "dir": false
          }],
          "329": [{
            "line": 6,
            "sta": [328, 329],
            "dis": 1794,
            "dir": true
          }]
        }
      },
      "329": {
        "name": "西黄村",
        "edges": {
          "328": [{
            "line": 6,
            "sta": [329, 328],
            "dis": 1794,
            "dir": false
          }],
          "330": [{
            "line": 6,
            "sta": [329, 330],
            "dis": 1792,
            "dir": true
          }]
        }
      },
      "330": {
        "name": "杨庄",
        "edges": {
          "329": [{
            "line": 6,
            "sta": [330, 329],
            "dis": 1792,
            "dir": false
          }],
          "1": [{
            "line": 6,
            "sta": [330, 1],
            "dis": 839,
            "dir": true
          }]
        }
      },
      "349": {
        "name": "黄厂",
        "edges": {
          "350": [{
            "line": 7,
            "sta": [349, 350],
            "dis": 1752,
            "dir": false
          }],
          "123": [{
            "line": 7,
            "sta": [349, 123],
            "dis": 1678,
            "dir": true
          }]
        }
      },
      "350": {
        "name": "郎辛庄",
        "edges": {
          "351": [{
            "line": 7,
            "sta": [350, 351],
            "dis": 2517,
            "dir": false
          }],
          "349": [{
            "line": 7,
            "sta": [350, 349],
            "dis": 1752,
            "dir": true
          }]
        }
      },
      "351": {
        "name": "黑庄户",
        "edges": {
          "352": [{
            "line": 7,
            "sta": [351, 352],
            "dis": 2961,
            "dir": false
          }],
          "350": [{
            "line": 7,
            "sta": [351, 350],
            "dis": 2517,
            "dir": true
          }]
        }
      },
      "352": {
        "name": "万盛西",
        "edges": {
          "353": [{
            "line": 7,
            "sta": [352, 353],
            "dis": 2110,
            "dir": false
          }],
          "351": [{
            "line": 7,
            "sta": [352, 351],
            "dis": 2961,
            "dir": true
          }]
        }
      },
      "353": {
        "name": "万盛东",
        "edges": {
          "354": [{
            "line": 7,
            "sta": [353, 354],
            "dis": 1160,
            "dir": false
          }],
          "352": [{
            "line": 7,
            "sta": [353, 352],
            "dis": 2110,
            "dir": true
          }]
        }
      },
      "354": {
        "name": "群芳",
        "edges": {
          "355": [{
            "line": 7,
            "sta": [354, 355],
            "dis": 1195,
            "dir": false
          }],
          "353": [{
            "line": 7,
            "sta": [354, 353],
            "dis": 1160,
            "dir": true
          }]
        }
      },
      "355": {
        "name": "高楼金",
        "edges": {
          "356": [{
            "line": 7,
            "sta": [355, 356],
            "dis": 1425,
            "dir": false
          }],
          "354": [{
            "line": 7,
            "sta": [355, 354],
            "dis": 1195,
            "dir": true
          }]
        }
      },
      "356": {
        "name": "花庄",
        "edges": {
          "357": [{
            "line": 7,
            "sta": [356, 357],
            "dis": 1769,
            "dir": false
          }, {
            "line": 97,
            "sta": [356, 357],
            "dis": 1863,
            "dir": false
          }],
          "355": [{
            "line": 7,
            "sta": [356, 355],
            "dis": 1425,
            "dir": true
          }],
          "248": [{
            "line": 97,
            "sta": [356, 248],
            "dis": 2238,
            "dir": true
          }]
        }
      },
      "357": {
        "name": "环球度假区",
        "edges": {
          "356": [{
            "line": 7,
            "sta": [357, 356],
            "dis": 1769,
            "dir": true
          }, {
            "line": 97,
            "sta": [357, 356],
            "dis": 1863,
            "dir": true
          }]
        }
      },
      "358": {
        "name": "清河站",
        "edges": {
          "185": [{
            "line": 13,
            "sta": [358, 185],
            "dis": 1036,
            "dir": false
          }],
          "186": [{
            "line": 13,
            "sta": [358, 186],
            "dis": 1545,
            "dir": true
          }, {
            "line": 94,
            "sta": [358, 186],
            "dis": 1545,
            "dir": false
          }],
          "430": [{
            "line": 94,
            "sta": [358, 430],
            "dis": 1652,
            "dir": true
          }]
        }
      },
      "359": {
        "name": "陶然桥",
        "edges": {
          "198": [{
            "line": 14,
            "sta": [359, 198],
            "dis": 1063,
            "dir": false
          }],
          "43": [{
            "line": 14,
            "sta": [359, 43],
            "dis": 887,
            "dir": true
          }]
        }
      },
      "360": {
        "name": "高家园",
        "edges": {
          "207": [{
            "line": 14,
            "sta": [360, 207],
            "dis": 676,
            "dir": false
          }],
          "206": [{
            "line": 14,
            "sta": [360, 206],
            "dis": 1171,
            "dir": true
          }]
        }
      },
      "381": {
        "name": "万泉河桥",
        "edges": {
          "58": [{
            "line": 16,
            "sta": [381, 58],
            "dis": 1980,
            "dir": false
          }],
          "150": [{
            "line": 16,
            "sta": [381, 150],
            "dis": 1486,
            "dir": true
          }]
        }
      },
      "382": {
        "name": "苏州桥",
        "edges": {
          "150": [{
            "line": 16,
            "sta": [382, 150],
            "dis": 1497,
            "dir": false
          }],
          "383": [{
            "line": 16,
            "sta": [382, 383],
            "dis": 1610,
            "dir": true
          }]
        }
      },
      "383": {
        "name": "万寿寺",
        "edges": {
          "382": [{
            "line": 16,
            "sta": [383, 382],
            "dis": 1610,
            "dir": false
          }],
          "51": [{
            "line": 16,
            "sta": [383, 51],
            "dis": 1721,
            "dir": true
          }]
        }
      },
      "384": {
        "name": "甘家口",
        "edges": {
          "419": [{
            "line": 16,
            "sta": [384, 419],
            "dis": 1046,
            "dir": false
          }],
          "405": [{
            "line": 16,
            "sta": [384, 405],
            "dis": 970,
            "dir": true
          }]
        }
      },
      "389": {
        "name": "东管头南",
        "edges": {
          "401": [{
            "line": 16,
            "sta": [389, 401],
            "dis": 1803,
            "dir": false
          }],
          "175": [{
            "line": 16,
            "sta": [389, 175],
            "dis": 1794,
            "dir": true
          }],
          "174": [{
            "line": 95,
            "sta": [389, 174],
            "dis": 1137,
            "dir": true
          }]
        }
      },
      "390": {
        "name": "花乡东桥",
        "edges": {
          "174": [{
            "line": 95,
            "sta": [390, 174],
            "dis": 1793,
            "dir": false
          }],
          "391": [{
            "line": 95,
            "sta": [390, 391],
            "dis": 1668,
            "dir": true
          }]
        }
      },
      "391": {
        "name": "白盆窑",
        "edges": {
          "390": [{
            "line": 95,
            "sta": [391, 390],
            "dis": 1668,
            "dir": false
          }],
          "140": [{
            "line": 95,
            "sta": [391, 140],
            "dis": 1138,
            "dir": true
          }]
        }
      },
      "395": {
        "name": "金鱼胡同",
        "edges": {
          "316": [{
            "line": 8,
            "sta": [395, 316],
            "dis": 873,
            "dir": false
          }],
          "16": [{
            "line": 8,
            "sta": [395, 16],
            "dis": 762,
            "dir": true
          }]
        }
      },
      "398": {
        "name": "北辛安",
        "edges": {
          "302": [{
            "line": 11,
            "sta": [398, 302],
            "dis": 850,
            "dir": false
          }],
          "399": [{
            "line": 11,
            "sta": [398, 399],
            "dis": 689,
            "dir": true
          }]
        }
      },
      "399": {
        "name": "新首钢",
        "edges": {
          "398": [{
            "line": 11,
            "sta": [399, 398],
            "dis": 689,
            "dir": false
          }]
        }
      },
      "400": {
        "name": "东管头",
        "edges": {
          "401": [{
            "line": 14,
            "sta": [400, 401],
            "dis": 958,
            "dir": false
          }],
          "177": [{
            "line": 14,
            "sta": [400, 177],
            "dis": 1489,
            "dir": true
          }]
        }
      },
      "401": {
        "name": "丽泽商务区",
        "edges": {
          "402": [{
            "line": 14,
            "sta": [401, 402],
            "dis": 828,
            "dir": false
          }],
          "400": [{
            "line": 14,
            "sta": [401, 400],
            "dis": 958,
            "dir": true
          }],
          "422": [{
            "line": 16,
            "sta": [401, 422],
            "dis": 1241,
            "dir": false
          }],
          "389": [{
            "line": 16,
            "sta": [401, 389],
            "dis": 1803,
            "dir": true
          }]
        }
      },
      "402": {
        "name": "菜户营",
        "edges": {
          "403": [{
            "line": 14,
            "sta": [402, 403],
            "dis": 1462,
            "dir": false
          }],
          "401": [{
            "line": 14,
            "sta": [402, 401],
            "dis": 828,
            "dir": true
          }]
        }
      },
      "403": {
        "name": "西铁营",
        "edges": {
          "416": [{
            "line": 14,
            "sta": [403, 416],
            "dis": 883,
            "dir": false
          }],
          "402": [{
            "line": 14,
            "sta": [403, 402],
            "dis": 1462,
            "dir": true
          }]
        }
      },
      "405": {
        "name": "玉渊潭东门",
        "edges": {
          "384": [{
            "line": 16,
            "sta": [405, 384],
            "dis": 970,
            "dir": false
          }],
          "2002": [{
            "line": 16,
            "sta": [405, 2002],
            "dis": 565,
            "dir": true
          }]
        }
      },
      "406": {
        "name": "周家庄",
        "edges": {
          "166": [{
            "line": 17,
            "sta": [406, 166],
            "dis": 1672,
            "dir": false
          }],
          "407": [{
            "line": 17,
            "sta": [406, 407],
            "dis": 2349,
            "dir": true
          }]
        }
      },
      "407": {
        "name": "十八里店",
        "edges": {
          "406": [{
            "line": 17,
            "sta": [407, 406],
            "dis": 2349,
            "dir": false
          }],
          "408": [{
            "line": 17,
            "sta": [407, 408],
            "dis": 5840,
            "dir": true
          }]
        }
      },
      "408": {
        "name": "北神树",
        "edges": {
          "407": [{
            "line": 17,
            "sta": [408, 407],
            "dis": 5840,
            "dir": false
          }],
          "409": [{
            "line": 17,
            "sta": [408, 409],
            "dis": 2334,
            "dir": true
          }]
        }
      },
      "409": {
        "name": "次渠北",
        "edges": {
          "408": [{
            "line": 17,
            "sta": [409, 408],
            "dis": 2334,
            "dir": false
          }],
          "292": [{
            "line": 17,
            "sta": [409, 292],
            "dis": 1455,
            "dir": true
          }]
        }
      },
      "410": {
        "name": "嘉会湖",
        "edges": {
          "292": [{
            "line": 17,
            "sta": [410, 292],
            "dis": 2125,
            "dir": false
          }]
        }
      },
      "411": {
        "name": "北太平庄",
        "edges": {
          "154": [{
            "line": 19,
            "sta": [411, 154],
            "dis": 920,
            "dir": false
          }],
          "25": [{
            "line": 19,
            "sta": [411, 25],
            "dis": 2450,
            "dir": true
          }]
        }
      },
      "412": {
        "name": "太平桥",
        "edges": {
          "48": [{
            "line": 19,
            "sta": [412, 48],
            "dis": 2710,
            "dir": false
          }],
          "413": [{
            "line": 19,
            "sta": [412, 413],
            "dis": 2140,
            "dir": true
          }],
          "12": [{
            "line": 1002,
            "sta": [412, 12],
            "dis": 0,
            "dir": true
          }]
        }
      },
      "413": {
        "name": "牛街",
        "edges": {
          "412": [{
            "line": 19,
            "sta": [413, 412],
            "dis": 2140,
            "dir": false
          }],
          "416": [{
            "line": 19,
            "sta": [413, 416],
            "dis": 2960,
            "dir": true
          }],
          "108": [{
            "line": 1001,
            "sta": [413, 108],
            "dis": 0,
            "dir": true
          }]
        }
      },
      "415": {
        "name": "新发地",
        "edges": {
          "172": [{
            "line": 19,
            "sta": [415, 172],
            "dis": 2650,
            "dir": false
          }],
          "259": [{
            "line": 19,
            "sta": [415, 259],
            "dis": 2740,
            "dir": true
          }]
        }
      },
      "416": {
        "name": "景风门",
        "edges": {
          "43": [{
            "line": 14,
            "sta": [416, 43],
            "dis": 1164,
            "dir": false
          }],
          "403": [{
            "line": 14,
            "sta": [416, 403],
            "dis": 883,
            "dir": true
          }],
          "413": [{
            "line": 19,
            "sta": [416, 413],
            "dis": 2960,
            "dir": false
          }],
          "172": [{
            "line": 19,
            "sta": [416, 172],
            "dis": 2680,
            "dir": true
          }]
        }
      },
      "417": {
        "name": "模式口",
        "edges": {
          "302": [{
            "line": 11,
            "sta": [417, 302],
            "dis": 1366,
            "dir": true
          }]
        }
      },
      "419": {
        "name": "二里沟",
        "edges": {
          "85": [{
            "line": 6,
            "sta": [419, 85],
            "dis": 887,
            "dir": false
          }],
          "84": [{
            "line": 6,
            "sta": [419, 84],
            "dis": 777,
            "dir": true
          }],
          "51": [{
            "line": 16,
            "sta": [419, 51],
            "dis": 1589,
            "dir": false
          }],
          "384": [{
            "line": 16,
            "sta": [419, 384],
            "dis": 1046,
            "dir": true
          }]
        }
      },
      "422": {
        "name": "红莲南路",
        "edges": {
          "107": [{
            "line": 16,
            "sta": [422, 107],
            "dis": 1552,
            "dir": false
          }],
          "401": [{
            "line": 16,
            "sta": [422, 401],
            "dis": 1241,
            "dir": true
          }]
        }
      },
      "426": {
        "name": "富丰桥",
        "edges": {
          "143": [{
            "line": 16,
            "sta": [426, 143],
            "dis": 1187,
            "dir": false
          }],
          "427": [{
            "line": 16,
            "sta": [426, 427],
            "dis": 1226,
            "dir": true
          }]
        }
      },
      "427": {
        "name": "看丹",
        "edges": {
          "426": [{
            "line": 16,
            "sta": [427, 426],
            "dis": 1226,
            "dir": false
          }],
          "428": [{
            "line": 16,
            "sta": [427, 428],
            "dis": 1442,
            "dir": true
          }]
        }
      },
      "428": {
        "name": "榆树庄",
        "edges": {
          "427": [{
            "line": 16,
            "sta": [428, 427],
            "dis": 1442,
            "dir": false
          }],
          "441": [{
            "line": 16,
            "sta": [428, 441],
            "dis": 1681,
            "dir": true
          }]
        }
      },
      "429": {
        "name": "宛平城",
        "edges": {
          "441": [{
            "line": 16,
            "sta": [429, 441],
            "dis": 1713,
            "dir": false
          }]
        }
      },
      "430": {
        "name": "朱房北",
        "edges": {
          "358": [{
            "line": 94,
            "sta": [430, 358],
            "dis": 1652,
            "dir": false
          }],
          "431": [{
            "line": 94,
            "sta": [430, 431],
            "dis": 1158,
            "dir": true
          }]
        }
      },
      "431": {
        "name": "清河小营桥",
        "edges": {
          "430": [{
            "line": 94,
            "sta": [431, 430],
            "dis": 1158,
            "dir": false
          }],
          "439": [{
            "line": 94,
            "sta": [431, 439],
            "dis": 2366,
            "dir": true
          }]
        }
      },
      "434": {
        "name": "学院桥",
        "edges": {
          "227": [{
            "line": 94,
            "sta": [434, 227],
            "dis": 1312,
            "dir": false
          }],
          "153": [{
            "line": 94,
            "sta": [434, 153],
            "dis": 1481,
            "dir": true
          }]
        }
      },
      "439": {
        "name": "学知园",
        "edges": {
          "431": [{
            "line": 94,
            "sta": [439, 431],
            "dis": 2366,
            "dir": false
          }],
          "227": [{
            "line": 94,
            "sta": [439, 227],
            "dis": 1683,
            "dir": true
          }]
        }
      },
      "441": {
        "name": "洪泰庄",
        "edges": {
          "428": [{
            "line": 16,
            "sta": [441, 428],
            "dis": 1681,
            "dir": false
          }],
          "429": [{
            "line": 16,
            "sta": [441, 429],
            "dis": 1713,
            "dir": true
          }]
        }
      },
      "442": {
        "name": "未来科学城北",
        "edges": {
          "443": [{
            "line": 17,
            "sta": [442, 443],
            "dis": 1724,
            "dir": true
          }]
        }
      },
      "443": {
        "name": "未来科学城",
        "edges": {
          "442": [{
            "line": 17,
            "sta": [443, 442],
            "dis": 1724,
            "dir": false
          }],
          "445": [{
            "line": 17,
            "sta": [443, 445],
            "dis": 5848,
            "dir": true
          }]
        }
      },
      "445": {
        "name": "天通苑东",
        "edges": {
          "443": [{
            "line": 17,
            "sta": [445, 443],
            "dis": 5848,
            "dir": false
          }],
          "446": [{
            "line": 17,
            "sta": [445, 446],
            "dis": 1935,
            "dir": true
          }]
        }
      },
      "446": {
        "name": "清河营",
        "edges": {
          "445": [{
            "line": 17,
            "sta": [446, 445],
            "dis": 1935,
            "dir": false
          }],
          "447": [{
            "line": 17,
            "sta": [446, 447],
            "dis": 1923,
            "dir": true
          }]
        }
      },
      "447": {
        "name": "红军营",
        "edges": {
          "446": [{
            "line": 17,
            "sta": [447, 446],
            "dis": 1923,
            "dir": false
          }],
          "2003": [{
            "line": 17,
            "sta": [447, 2003],
            "dis": 5022,
            "dir": true
          }]
        }
      },
      "448": {
        "name": "西坝河",
        "edges": {
          "158": [{
            "line": 17,
            "sta": [448, 158],
            "dis": 1207,
            "dir": false
          }],
          "449": [{
            "line": 17,
            "sta": [448, 449],
            "dis": 2411,
            "dir": true
          }]
        }
      },
      "449": {
        "name": "左家庄",
        "edges": {
          "448": [{
            "line": 17,
            "sta": [449, 448],
            "dis": 2411,
            "dir": false
          }],
          "450": [{
            "line": 17,
            "sta": [449, 450],
            "dis": 2324,
            "dir": true
          }]
        }
      },
      "450": {
        "name": "工人体育场",
        "edges": {
          "449": [{
            "line": 17,
            "sta": [450, 449],
            "dis": 2324,
            "dir": false
          }]
        }
      },
      "1002": {
        "name": "红庙",
        "edges": {
          "90": [{
            "line": 14,
            "sta": [1002, 90],
            "dis": 894,
            "dir": false
          }],
          "21": [{
            "line": 14,
            "sta": [1002, 21],
            "dis": 708,
            "dir": true
          }]
        }
      },
      "1001": {
        "name": "南八里庄",
        "edges": {
          "201": [{
            "line": 14,
            "sta": [1001, 201],
            "dis": 1276,
            "dir": false
          }],
          "166": [{
            "line": 14,
            "sta": [1001, 166],
            "dis": 1147,
            "dir": true
          }]
        }
      },
      "2001": {
        "name": "木樨地1",
        "edges": {
          "11": [{
            "line": 1,
            "sta": [2001, 11],
            "dis": 1291,
            "dir": false
          }],
          "9": [{
            "line": 1,
            "sta": [2001, 9],
            "dis": 1166,
            "dir": true
          }],
          "2002": [{
            "line": 1003,
            "sta": [2001, 2002],
            "dis": 0,
            "dir": true
          }]
        }
      },
      "2002": {
        "name": "木樨地16",
        "edges": {
          "405": [{
            "line": 16,
            "sta": [2002, 405],
            "dis": 565,
            "dir": false
          }],
          "107": [{
            "line": 16,
            "sta": [2002, 107],
            "dis": 2004,
            "dir": true
          }],
          "2001": [{
            "line": 1003,
            "sta": [2002, 2001],
            "dis": 0,
            "dir": false
          }]
        }
      },
      "2003": {
        "name": "望京西17",
        "edges": {
          "447": [{
            "line": 17,
            "sta": [2003, 447],
            "dis": 5022,
            "dir": false
          }],
          "158": [{
            "line": 17,
            "sta": [2003, 158],
            "dis": 2500,
            "dir": true
          }],
          "190": [{
            "line": 1004,
            "sta": [2003, 190],
            "dis": 0,
            "dir": true
          }]
        }
      }
    },
    "lineDetail": {
      "1": {
        "name": "一号线",
        "hex": "#BE3631",
        "dark": false,
        "vit": false,
        "staList": [1, 2, 3, 4, 5, 6, 7, 8, 9, 2001, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
        "t1": "北京市地铁运营有限公司"
      },
      "2": {
        "name": "二号线",
        "hex": "#0F6192",
        "dark": false,
        "vit": false,
        "staList": [24, 25, 26, 27, 28, 29, 30, 31, 18, 32, 33, 34, 35, 36, 37, 12, 38, 39],
        "t1": "北京市地铁运营有限公司"
      },
      "4": {
        "name": "四号线",
        "hex": "#008994",
        "dark": false,
        "vit": false,
        "staList": [60, 59, 58, 57, 56, 55, 54, 53, 52, 51, 50, 24, 49, 48, 47, 46, 13, 36, 45, 44, 43, 42, 41, 40],
        "t1": "北京京港地铁有限公司"
      },
      "5": {
        "name": "五号线",
        "hex": "#A5237A",
        "dark": false,
        "vit": false,
        "staList": [61, 62, 63, 64, 65, 33, 17, 66, 67, 68, 69, 28, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80],
        "t1": "北京市地铁运营有限公司"
      },
      "6": {
        "name": "六号线",
        "hex": "#D29404",
        "dark": false,
        "vit": false,
        "staList": [302, 1, 330, 329, 328, 327, 81, 82, 83, 84, 419, 85, 39, 48, 86, 87, 67, 31, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104],
        "t1": "北京市地铁运营有限公司"
      },
      "7": {
        "name": "七号线",
        "hex": "#F9C374",
        "dark": true,
        "vit": false,
        "staList": [105, 106, 107, 108, 45, 109, 110, 111, 65, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 349, 350, 351, 352, 353, 354, 355, 356, 357],
        "t1": "北京市地铁运营有限公司"
      },
      "8": {
        "name": "八号线",
        "hex": "#009263",
        "dark": false,
        "vit": false,
        "staList": [124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 26, 139, 87, 316, 395, 16, 34, 110, 317, 198, 319, 318, 170, 320, 321, 322, 323, 324, 325, 326],
        "t1": "北京市地铁运营有限公司"
      },
      "9": {
        "name": "九号线",
        "hex": "#96BE0B",
        "dark": true,
        "vit": false,
        "staList": [140, 141, 142, 143, 144, 145, 146, 147, 105, 9, 148, 84, 51],
        "t1": "北京市地铁运营有限公司"
      },
      "10": {
        "name": "十号线",
        "hex": "#009ABA",
        "dark": false,
        "vit": false,
        "staList": [149, 150, 54, 151, 152, 153, 154, 155, 136, 156, 72, 157, 158, 159, 160, 161, 162, 89, 163, 20, 114, 164],
        "t1": "北京市地铁运营有限公司"
      },
      "11": {
        "name": "十一号线",
        "hex": "#ED796B",
        "dark": false,
        "vit": false,
        "staList": [417, 302, 398, 399],
        "t1": "北京市地铁运营有限公司"
      },
      "13": {
        "name": "十三号线",
        "hex": "#F8E114",
        "dark": true,
        "vit": false,
        "staList": [24, 183, 152, 184, 185, 358, 186, 187, 188, 128, 77, 189, 190, 157, 191, 192, 29],
        "t1": "北京市地铁运营有限公司"
      },
      "14": {
        "name": "十四号线",
        "hex": "#D4A7A1",
        "dark": true,
        "vit": false,
        "staList": [212, 211, 210, 209, 208, 207, 360, 206, 205, 204, 203, 90, 1002, 21, 115, 202, 201, 1001, 166, 200, 63, 199, 198, 359, 43, 400, 401, 402, 403, 416, 177, 145, 197, 196, 195, 194, 193],
        "t1": "北京京港地铁有限公司"
      },
      "15": {
        "name": "十五号线",
        "hex": "#6B3777",
        "dark": false,
        "vit": false,
        "staList": [213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 209, 190, 224, 74, 225, 134, 226, 227, 228],
        "t1": "北京市地铁运营有限公司"
      },
      "16": {
        "name": "十六号线",
        "hex": "#7C9E21",
        "dark": false,
        "vit": false,
        "staList": [237, 236, 235, 234, 233, 232, 231, 230, 229, 58, 381, 150, 382, 383, 51, 419, 384, 405, 2002, 107, 422, 401, 389, 175, 143, 426, 427, 428, 441, 429],
        "t1": "北京京港地铁有限公司"
      },
      "17": {
        "name": "十七号线",
        "hex": "#00A9A9",
        "dark": false,
        "vit": false,
        "staList": [442, 443, 445, 446, 447, 2003, 158, 448, 449, 450, 166, 406, 407, 408, 409, 292, 410],
        "t1": "北京地铁十七号线投资有限公司"
      },
      "19": {
        "name": "十九号线",
        "hex": "#D6ABC1",
        "dark": true,
        "vit": false,
        "staList": [154, 411, 25, 48, 412, 413, 416, 172, 415, 259],
        "t1": "北京市轨道交通运营管理有限公司"
      },
      "90": {
        "name": "十号线二期",
        "hex": "#009ABA",
        "dark": false,
        "vit": false,
        "staList": [165, 166, 167, 168, 61, 169, 170, 171, 41, 172, 173, 174, 175, 176, 177, 146, 178, 8, 179, 82, 180, 181, 182],
        "t1": "北京市地铁运营有限公司"
      },
      "91": {
        "name": "S1线",
        "hex": "#B0561F",
        "dark": false,
        "vit": false,
        "staList": [308, 307, 306, 305, 304, 303, 302, 1],
        "t1": "北京市地铁运营有限公司"
      },
      "92": {
        "name": "燕房线",
        "hex": "#E15C28",
        "dark": false,
        "vit": false,
        "staList": [301, 300, 299, 298, 297, 296, 295, 294, 270],
        "t1": "北京市轨道交通运营管理有限公司"
      },
      "93": {
        "name": "大兴线",
        "hex": "#008994",
        "dark": false,
        "vit": false,
        "staList": [259, 258, 257, 256, 255, 254, 253, 252, 251, 250, 249],
        "t1": "北京轨道交通大兴线投资有限责任公司"
      },
      "94": {
        "name": "昌平线",
        "hex": "#DD83B0",
        "dark": true,
        "vit": false,
        "staList": [271, 272, 273, 274, 275, 276, 277, 278, 279, 124, 280, 186, 358, 430, 431, 439, 227, 434, 153],
        "t1": "北京市地铁运营有限公司"
      },
      "95": {
        "name": "房山线",
        "hex": "#E15C28",
        "dark": false,
        "vit": false,
        "staList": [389, 174, 390, 391, 140, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270],
        "t1": "北京市地铁运营有限公司"
      },
      "96": {
        "name": "亦庄线",
        "hex": "#E20072",
        "dark": false,
        "vit": false,
        "staList": [61, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293],
        "t1": "北京市地铁运营有限公司"
      },
      "97": {
        "name": "八通线",
        "hex": "#BE3631",
        "dark": false,
        "vit": false,
        "staList": [22, 23, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 356, 357],
        "t1": "北京市地铁运营有限公司"
      },
      "1000": {
        "name": "自定义换乘",
        "hex": "#808080",
        "dark": false,
        "vit": true,
        "staList": [],
        "t1": "无"
      },
      "1001": {
        "name": "虚拟换乘",
        "hex": "#808080",
        "dark": false,
        "vit": true,
        "staList": [],
        "t1": "无"
      },
      "1002": {
        "name": "虚拟换乘",
        "hex": "#808080",
        "dark": false,
        "vit": true,
        "staList": [],
        "t1": "无"
      },
      "1003": {
        "name": "虚拟换乘",
        "hex": "#808080",
        "dark": false,
        "vit": true,
        "staList": [],
        "t1": "无"
      },
      "1004": {
        "name": "虚拟换乘",
        "hex": "#808080",
        "dark": false,
        "vit": true,
        "staList": [],
        "t1": "无"
      }
    },
    "rules": ["求解路径时使用的逻辑规则由分析ACC实际票价结果反向推测得到, 无法保证一定准确", "路径规划的唯一目标(权重)是使总计价里程最短, 而不考虑换乘次数等其他任何因素", "里程超出当前票价区间里程阈值, 但不超过%FREE_DIS%m的, 票价仍按当前区间计算", "计算结果只与起点站和终点站有关, 与线路无关, 因此在选择车站时从列表中的不同线路选择相同的车站会得到完全相同的结果", "暂缓开通的非换乘车站视为已经开通", "除木樨地、望京西外, 暂缓开通的换乘站视为已经开通并可以正常换乘", "木樨地视为可以虚拟换乘且连续计费的独立的两个车站(木樨地1、木樨地16)", "望京西视为不可以虚拟换乘的独立的两个车站(望京西、望京西17)", "本工具中的虚拟换乘均连续计费(现实中的虚拟换乘车站除木樨地外在计算票价时均视为两个车站之间无法换乘, 亦不连续计费)"],
    "mainRegion": {
      "lines": [1, 2, 4, 5, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 19, 90, 91, 92, 93, 94, 95, 96, 97],
      "vit": [1000, 1001, 1002, 1003, 1004],
      "vitEnabled": [1000, 1003]
    }
  }
};